
&После("ПриКопировании")
Процедура Buro1Goz_ПриКопировании(ОбъектКопирования)
	
	ГозКонтракт = Неопределено;
	ГОЗ.Очистить();
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Buro1Goz_ПриЗаписи(Отказ)
	
	
	
	СтатьяЗатрат = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("УТ-000029");
	
	Если ЗначениеЗаполнено(ГозКонтракт) Тогда
		Если ГОЗ.Количество() = 0 Тогда
			НоваяСтрока = ГОЗ.Добавить();
			НоваяСтрока.СтатьиРасходовГоз = СтатьяЗатрат;
			НоваяСтрока.Сумма = ЭтотОбъект.СуммаДокумента;
		Иначе
			СтрОтбора = Новый Структура;
			СтрОтбора.Вставить("СтатьиРасходовГоз", СтатьяЗатрат);
			НСтроки = ГОЗ.НайтиСтроки(СтрОтбора);
			Если НСтроки.Количество() = ГОЗ.Количество() И НСтроки[0].Сумма = 0 Тогда
				НСтроки[0].Сумма = ЭтотОбъект.СуммаДокумента;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры