
&НаКлиенте
Процедура ЗаполнениеДокументов(Команда)
	ЗаполнениеДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеДокументовНаСервере() 
	
	
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаСерийников.Область());
	ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();   
	
	Выборка = ПЗ.Результат.Выгрузить();
	
	ТаблицаСерийныеНомера.Очистить();
	
	Для Каждого Строка из Выборка Цикл
		
		Если ТолькоРеализации Тогда
			
			Запрос2 = Новый Запрос("
			|ВЫБРАТЬ
			|	СерийныеНомераНаПечать.СерийныйНомер КАК СерийныйНомер,
			|	СерийныеНомераНаПечать.Реализация КАК Реализация
			|ИЗ
			|	РегистрСведений.СерийныеНомераНаПечать КАК СерийныеНомераНаПечать
			|ГДЕ
			|	СерийныеНомераНаПечать.СерийныйНомер = &СерийныйНомер
			|	И СерийныеНомераНаПечать.Реализация ССЫЛКА Документ.РеализацияТоваровУслуг"); 
			
			Запрос2.УстановитьПараметр("СерийныйНомер", Строка.СерийныеНомера);			
			
			РезультатЗапроса = Запрос2.Выполнить().Выгрузить(); 
			
			Для каждого СтрокаРезультата из РезультатЗапроса Цикл
				
				НоваяСтрока = ТаблицаСерийныеНомера.Добавить(); 
				НоваяСтрока.СерийныеНомера = СтрокаРезультата.СерийныйНомер;
				НоваяСтрока.ДокументРеализации = СтрокаРезультата.Реализация;
				
			КонецЦикла;	
			
		Иначе
			
			Запрос2 = Новый Запрос("
			|ВЫБРАТЬ
			|	СерийныеНомераНаПечать.СерийныйНомер КАК СерийныйНомер,
			|	СерийныеНомераНаПечать.Реализация КАК Реализация
			|ИЗ
			|	РегистрСведений.СерийныеНомераНаПечать КАК СерийныеНомераНаПечать
			|ГДЕ
			|	СерийныеНомераНаПечать.СерийныйНомер = &СерийныйНомер");
			
			Запрос2.УстановитьПараметр("СерийныйНомер", Строка.СерийныеНомера);			
			
			РезультатЗапроса = Запрос2.Выполнить().Выгрузить(); 
			
			Если РезультатЗапроса.Количество() = 0 Тогда 
				
				НоваяСтрока = ТаблицаСерийныеНомера.Добавить(); 
				НоваяСтрока.СерийныеНомера = Строка.СерийныеНомера;
				НоваяСтрока.ДокументРеализации = "Документ не найден";
				
			Иначе 
				
				Для каждого СтрокаРезультата из РезультатЗапроса Цикл
					
					НоваяСтрока = ТаблицаСерийныеНомера.Добавить(); 
					НоваяСтрока.СерийныеНомера = СтрокаРезультата.СерийныйНомер;
					НоваяСтрока.ДокументРеализации = СтрокаРезультата.Реализация;
					
				КонецЦикла;	
				
			КонецЕсли;			
			
		КонецЕсли; 	
		
	КонецЦикла;
	
КонецПроцедуры
