
&После("ПередЗаписью")
Процедура Buro1Goz_ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Документ = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		И Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет 
		И Документ.НеЗаписыватьСебестИТовОрг
		И НЕ Документ.Организация = Справочники.Организации.УправленческаяОрганизация Тогда
		
		Набор = ЭтотОбъект.Выгрузить();
		
		НайденныеСтроки = Набор.НайтиСтроки(Новый Структура("Организация", Документ.Организация));
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Набор.Удалить(НайденнаяСтрока);	
			
		КонецЦикла;
		
		ЭтотОбъект.Загрузить(Набор);    		
		
	КонецЕсли;	
		
	
КонецПроцедуры
