
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетШтрихКодов Приход
	Движения.УчетШтрихКодов.Записывать = Истина;
	Для Каждого ТекСтрокаСерийныйНомера Из СерийныйНомера Цикл
		Движение = Движения.УчетШтрихКодов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СерийныйНомер = ТекСтрокаСерийныйНомера.СерийныйНомер;
		Движение.Количество = 1;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СерийныйНомера.Свернуть("СерийныйНомер");
КонецПроцедуры
