
&После("ОбработкаЗаполнения")
Процедура Buro1Goz_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование") И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ГозКонтракт = ДанныеЗаполнения.ДокументОснование.ГозКонтракт;
		ГОЗ.Загрузить(ДанныеЗаполнения.ДокументОснование.ГОЗ.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Buro1Goz_ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ГозКонтракт) И ЗначениеЗаполнено(Ссылка) Тогда
		СпрСсылка = Справочники.ЗакупкаТоваровВРазрезеГозКонтракта.НайтиПоРеквизиту("ПриобретениеТоваровУслуг", Ссылка);
		Если СпрСсылка.Пустая() Тогда
			СпрОб = Справочники.ЗакупкаТоваровВРазрезеГозКонтракта.СоздатьЭлемент();
			
			СпрОб.ПриобретениеТоваровУслуг = Ссылка; 
			СпрОб.Товары.Загрузить(Товары.Выгрузить());
			
			Для Каждого ТекСтрока Из СпрОб.Товары Цикл
				ТекСтрока.ГозКонтракт = ГозКонтракт;
			КонецЦикла;
			
			СтрокаДанных = СпрОб.СтатьиЗатрат.Добавить();
			СтрокаДанных.Сумма = СуммаДокумента;
			СтрокаДанных.ГозКонтракт = ГозКонтракт;
			
			СпрОб.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Buro1Goz_ОбработкаПроведения(Отказ, РежимПроведения)
	
	B1_ОбщегоНазначения.ДвиженияТоваровБухгалтерии(Отказ, ЭтотОбъект, "Товары");
	
КонецПроцедуры
