
Процедура ДвиженияТоваровБухгалтерии(Отказ, РегистраторОбъект, ИмяТабЧасти, УдалениеДвижений = Ложь) Экспорт

	РегистраторОбъект.Движения.ТоварыБухгалтерии.Записывать = Истина;	
	
	Если УдалениеДвижений Тогда
	    Возврат;	
	КонецЕсли;
	
	Если НЕ РегистраторОбъект[ИмяТабЧасти].Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Если НЕ ТипЗнч(РегистраторОбъект) = Тип("ДокументОбъект.КорректировкаТоваровБухгалтерии") Тогда
	
		Если НЕ РегистраторОбъект.Организация = Справочники.ПредопределенныеЗначения.ПолучитьПредопределенноеЗначение("ОрганизацияДельтаКопирс") ИЛИ РегистраторОбъект.НеВыгружатьВБП Тогда
		
			Возврат;	
		
		КонецЕсли;	
	
	КонецЕсли;
		
	Для каждого СтрокаТаб Из РегистраторОбъект[ИмяТабЧасти] Цикл
		
		Если СтрокаТаб.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Если ТипЗнч(РегистраторОбъект) = Тип("ДокументОбъект.КорректировкаТоваровБухгалтерии") Тогда
			
			Если СтрокаТаб.Количество < 0 Тогда
				НовСтр = РегистраторОбъект.Движения.ТоварыБухгалтерии.ДобавитьРасход();
			Иначе
				НовСтр = РегистраторОбъект.Движения.ТоварыБухгалтерии.ДобавитьПриход();
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(РегистраторОбъект) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда	
			
			НовСтр = РегистраторОбъект.Движения.ТоварыБухгалтерии.ДобавитьПриход();
			НовСтр.СуммаЗакупки = СтрокаТаб.СуммаСНДС;
			
		ИначеЕсли ТипЗнч(РегистраторОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда	
			
			НовСтр = РегистраторОбъект.Движения.ТоварыБухгалтерии.ДобавитьРасход(); 	
			НовСтр.СуммаПродажи = СтрокаТаб.СуммаСНДС;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовСтр, СтрокаТаб);
		НовСтр.Количество = Макс(НовСтр.Количество, -НовСтр.Количество);
		НовСтр.Период = РегистраторОбъект.Дата;
		НовСтр.Склад = РегистраторОбъект.Склад; 
		
	КонецЦикла;
		
КонецПроцедуры
