
&НаСервере
Процедура Buro1Goz_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	СтраницаДоп  = Элементы.Добавить("Дополнительно", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	СтраницаДоп.Заголовок = НСтр("ru = 'Дополнительно'");
	СтраницаДоп.Вид = ВидГруппыФормы.Страница;
	
	ПолеНеДелатьДвиженияПоРезервамТоваровОрганизации = Элементы.Добавить("НеДелатьДвиженияПоРезервамТоваровОрганизации", Тип("ПолеФормы"), СтраницаДоп);
	ПолеНеДелатьДвиженияПоРезервамТоваровОрганизации.Вид = ВидПоляФормы.ПолеФлажка;                            
	ПолеНеДелатьДвиженияПоРезервамТоваровОрганизации.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеНеДелатьДвиженияПоРезервамТоваровОрганизации.ПутьКДанным = "Объект.НеДелатьДвиженияПоРезервамТоваровОрганизации";
		
	СтраницаГВ_ГОЗ  = Элементы.Добавить("ГОЗ", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
	СтраницаГВ_ГОЗ.Заголовок = НСтр("ru = 'Контракты ГОЗ'");
	СтраницаГВ_ГОЗ.Вид = ВидГруппыФормы.Страница;
	
	ПолеДляДокГОЗ = Элементы.Добавить("B1_КонтрактыГОЗ", Тип("ПолеФормы"), СтраницаГВ_ГОЗ);
	ПолеДляДокГОЗ.Вид = ВидПоляФормы.ПолеВвода;                            
	ПолеДляДокГОЗ.Заголовок = "Контракт ГОЗ(документ)";
	ПолеДляДокГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеДляДокГОЗ.ПутьКДанным = "Объект.ГозКонтракт";
	
	ПолеДляДокГОЗ = Элементы.Добавить("ОприходованиеСерийНаСклад", Тип("ПолеФормы"), СтраницаГВ_ГОЗ);
	ПолеДляДокГОЗ.Вид = ВидПоляФормы.ПолеПереключателя;                            
	ПолеДляДокГОЗ.ПутьКДанным = "Объект.ОприходованиеСерийНаСклад";
	
	ТЧРасходыГОЗ = Элементы.Добавить("B1_ТЧ_ГОЗ", Тип("ТаблицаФормы"), СтраницаГВ_ГОЗ);
	ТЧРасходыГОЗ.ПутьКДанным = "Объект.ГОЗ";
	ТЧРасходыГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;    
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабЧасти = Об.Метаданные().ТабличныеЧасти;	
	Для каждого КолонкаОбъекта Из ТабЧасти.ГОЗ.СтандартныеРеквизиты Цикл
		
		ИмяКолонки = "B1_ТЧ_ГОЗ" + КолонкаОбъекта.Имя;
		
		ЭлементыТаблицыФормы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТЧРасходыГОЗ);
		ЭлементыТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементыТаблицыФормы.ПутьКДанным = "Объект.ГОЗ." + КолонкаОбъекта.Имя;	
	
	КонецЦикла;
	
	Для каждого КолонкаОбъекта Из ТабЧасти.ГОЗ.Реквизиты Цикл
		
		ИмяКолонки = "B1_ТЧ_ГОЗ" + КолонкаОбъекта.Имя;
		
		ЭлементыТаблицыФормы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТЧРасходыГОЗ);
		ЭлементыТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементыТаблицыФормы.ПутьКДанным = "Объект.ГОЗ." + КолонкаОбъекта.Имя;	
	
	КонецЦикла;
	
	ПолеДляДокГОЗ = Элементы.Добавить("НоменклатураСканирования", Тип("ПолеФормы"), Элементы.ГруппаСерийныеНомера);
	ПолеДляДокГОЗ.Вид = ВидПоляФормы.ПолеВвода;                            
	ПолеДляДокГОЗ.Заголовок = "Номенклатура сканирования";
	ПолеДляДокГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеДляДокГОЗ.ПутьКДанным = "Объект.НоменклатураСканирования";
	ПолеДляДокГОЗ.КнопкаВыбора = Ложь;
	ПолеДляДокГОЗ.РежимВыбораИзСписка = Истина;
	ПолеДляДокГОЗ.УстановитьДействие(
		"НачалоВыбора", 		   
		"НачалоВыбораНоменклатураСканирования");
	
	Элементы.Переместить(ПолеДляДокГОЗ, Элементы.ГруппаСерийныеНомера, Элементы.ВсегоСерийныхНомеров);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		ПолеДляДокГОЗ.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокВыбораНаСервере());	
	
	КонецЕсли;
	
	Buro1Goz_ОбновитьДанныеПослеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораНоменклатураСканирования(Элемент)
	
	МассивВыбора = ПолучитьСписокВыбораНаСервере();
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивВыбора);
	Если МассивВыбора.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В табличной части отсутствуют товары, либо не настроен макет для сканируемой номенклатуры!";
		Сообщение.Сообщить();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораНаСервере()

	СписокВыбора = Новый СписокЗначений;
	
	ЗапросНоменклатурыСканирования = Новый Запрос("
			|ВЫБРАТЬ
			|	НастройкаСобственныхСерийныхНомеров.Номенклатура КАК Номенклатура,
			|	НастройкаСобственныхСерийныхНомеров.ИмяМакета КАК ИмяМакета
			|ИЗ
			|	РегистрСведений.НастройкаСобственныхСерийныхНомеров КАК НастройкаСобственныхСерийныхНомеров
			|ГДЕ
			|	НастройкаСобственныхСерийныхНомеров.Номенклатура В (&Номенклатура)");
	
	ЗапросНоменклатурыСканирования.УстановитьПараметр("Номенклатура", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	Возврат ЗапросНоменклатурыСканирования.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");

КонецФункции

&НаСервере
Процедура Buro1Goz_ОбновитьДанныеПослеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерийныеНомераНаПечатьСрезПоследних.СерийныйНомер КАК СерийныйНомер,
	|	1 КАК Количество
	|ИЗ
	|	РегистрСведений.СерийныеНомераНаПечать.СрезПоследних(, ) КАК СерийныеНомераНаПечатьСрезПоследних
	|ГДЕ
	|	СерийныеНомераНаПечатьСрезПоследних.Реализация = &Реализация";
	Запрос.УстановитьПараметр("Реализация", Объект.Ссылка);
	СерийныеНомера.Загрузить(Запрос.Выполнить().Выгрузить());
	ВсегоСерийныхНомеров = СерийныеНомера.Количество();
	
	Элементы.СтраницаСерийныеНомера.Заголовок = СтрШаблон("Серийные номера (%1)", СтрЗаменить(ВсегоСерийныхНомеров, Символы.НПП, ""));
	
КонецПроцедуры

&НаКлиенте
Процедура Buro1Goz_ОбновитьДанныеПосле(Команда)
	Buro1Goz_ОбновитьДанныеПослеНаСервере();
КонецПроцедуры
