
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос23 = Новый Запрос;
	Запрос23.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ТоварыОрганизацийОбороты.КоличествоРасход) КАК КоличествоРасход,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|	НАЧАЛОПЕРИОДА(ТоварыОрганизацийОбороты.Период, ДЕНЬ) КАК Дата,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНач, &ДатаКон, Регистратор, Организация = &Организация) КАК ТоварыОрганизацийОбороты
	|ГДЕ
	|	ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ТоварыОрганизацийОбороты.КоличествоРасход > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыОрганизацийОбороты.Период, ДЕНЬ),
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.МестоХранения,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|	НАЧАЛОПЕРИОДА(ТоварыОрганизацийОбороты.Период, ДЕНЬ) КАК Дата,
	|	СУММА(ТоварыОрганизацийОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВременнаяТаблица1
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНач, &ДатаКон, Регистратор, Организация = &Организация) КАК ТоварыОрганизацийОбороты
	|ГДЕ
	|	ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ТоварыОрганизацийОбороты.КоличествоПриход > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.МестоХранения,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
	|	НАЧАЛОПЕРИОДА(ТоварыОрганизацийОбороты.Период, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийОбороты.Регистратор КАК Регистратор,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|	НАЧАЛОПЕРИОДА(ТоварыОрганизацийОбороты.Период, ДЕНЬ) КАК Дата,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВременнаяТаблицаДокумент
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНач, &ДатаКон, Регистратор, Организация = &Организация) КАК ТоварыОрганизацийОбороты
	|ГДЕ
	|	ТоварыОрганизацийОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ТоварыОрганизацийОбороты.КоличествоРасход > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыОрганизацийОбороты.Период, ДЕНЬ),
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.МестоХранения,
	|	ТоварыОрганизацийОбороты.Регистратор,
	|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДокумент.Регистратор КАК Реализация,
	|	ВременнаяТаблица.Дата КАК Дата,
	|	ВременнаяТаблица.Склад КАК Склад,
	|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблица.КоличествоРасход КАК Количество,
	|	ВременнаяТаблица1.КоличествоПриход КАК КоличествоПриход
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица1 КАК ВременнаяТаблица1
	|		ПО ВременнаяТаблица.Склад = ВременнаяТаблица1.Склад
	|			И ВременнаяТаблица.Дата = ВременнаяТаблица1.Дата
	|			И ВременнаяТаблица.Номенклатура = ВременнаяТаблица1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокумент КАК ВременнаяТаблицаДокумент
	|		ПО ВременнаяТаблица.Склад = ВременнаяТаблицаДокумент.Склад
	|			И ВременнаяТаблица.Дата = ВременнаяТаблицаДокумент.Дата
	|			И ВременнаяТаблица.Номенклатура = ВременнаяТаблицаДокумент.Номенклатура
	|ГДЕ
	|	ВременнаяТаблица.КоличествоРасход <> ЕСТЬNULL(ВременнаяТаблица1.КоличествоПриход, 0)
	|	И ВременнаяТаблица.Номенклатура В(&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос23.УстановитьПараметр("Организация", Справочники.Организации.УправленческаяОрганизация); // Управленческая организация
	Запрос23.УстановитьПараметр("ДатаНач", НачалоДня(СтПериод.ДатаНачала));
	Запрос23.УстановитьПараметр("ДатаКон", КонецДня(СтПериод.ДатаОкончания));
	Запрос23.УстановитьПараметр("Номенклатура", Номенклатура.ВыгрузитьЗначения());
	
	Если Не Номенклатура.ВыгрузитьЗначения().Количество() Тогда
		Запрос23.Текст = СтрЗаменить(Запрос23.Текст, "ВременнаяТаблица.Номенклатура В(&Номенклатура)", "ИСТИНА");
	КонецЕсли;
		
	
	Товары.Загрузить(Запрос23.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтПериод.ДатаНачала = НачалоМесяца(ТекущаяДата());
	СтПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
КонецПроцедуры
