
&НаСервере
Процедура ЗаполнитьДокументыСборкиНаСервере()
	
	ИтогоРаспределено = 0;
	ИтогоПоСборке = 0;
	Распределить = 0;
	      		
		Запрос8 = Новый Запрос;
		Запрос8.Текст = 
		"ВЫБРАТЬ
		|	СборкаТоваровТовары.Ссылка КАК Сборка,
		|	СборкаТоваровТовары.Номенклатура КАК Номенклатура,
		|	СборкаТоваровТовары.Характеристика КАК Характеристика,
		|	СборкаТоваровТовары.Ссылка.ВариантКомплектации КАК ВариантКомплектации,
		|	СборкаТоваровТовары.Количество КАК Количество
		|ИЗ
		|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
		|ГДЕ
		|	СборкаТоваровТовары.Номенклатура = &Номенклатура
		|	И СборкаТоваровТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|	И СборкаТоваровТовары.Ссылка.Проведен = ИСТИНА
		|	И СборкаТоваровТовары.Ссылка.ГозКонтракт = &ГозКонтракт
		|
		|УПОРЯДОЧИТЬ ПО
		|	СборкаТоваровТовары.Ссылка.Дата"; 
		
		Запрос8.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Если ЗначениеЗаполнено(Контракт) Тогда
			Запрос8.УстановитьПараметр("ГозКонтракт", Контракт);
		Иначе 
			Запрос8.Текст = СтрЗаменить(Запрос8.Текст, "СборкаТоваровТовары.Ссылка.ГозКонтракт = &ГозКонтракт", "ИСТИНА");
		КонецЕсли;
		
	ДокументыСборки.Загрузить(Запрос8.Выполнить().Выгрузить());
	
	ИтогоПоСборке = ДокументыСборки.Итог("Количество");
	
	Запрос8.Текст = 
	"ВЫБРАТЬ
	|	СборкаТоваровТовары.Ссылка.Номенклатура КАК Номенклатура,
	|	СборкаТоваровТовары.Ссылка.ВариантКомплектации КАК ВариантКомплектации
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
	|ГДЕ
	|	СборкаТоваровТовары.Номенклатура = &Номенклатура
	|	И СборкаТоваровТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И СборкаТоваровТовары.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаТоваровТовары.Ссылка.Номенклатура,
	|	СборкаТоваровТовары.Ссылка.ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
	|	ВремТаб.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВремТаб КАК ВремТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВремТаб.ВариантКомплектации = ВариантыКомплектацииНоменклатурыТовары.Ссылка
	|ГДЕ
	|	НЕ ВариантыКомплектацииНоменклатурыТовары.Количество ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремТаб.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество";
	
	ЗакупаемыеТовары.Загрузить(Запрос8.Выполнить().Выгрузить());
	
	Запрос8.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК ПоступлениеТоваров,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Количество КАК Количество
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Номенклатура В(&Номенклатура)
	|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Ссылка.Дата";
	
	ТабЗнач = ЗакупаемыеТовары.Выгрузить();
	
	Если ЗначениеЗаполнено(ТабЗнач) Тогда
		
		Запрос8.УстановитьПараметр("Номенклатура", ЗакупаемыеТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура")); 
		
	Иначе 
		
		Запрос8.УстановитьПараметр("Номенклатура", Номенклатура);
		
	КонецЕСли;
	
	ДокументыЗакупки.Загрузить(Запрос8.Выполнить().Выгрузить());
	
	СтрОтбора = Новый Структура;
	
	Для Каждого ТекСтрока Из ДокументыЗакупки Цикл
		СтрОтбора.Вставить("Номенклатура", ТекСтрока.Номенклатура);
		СтрокиДляПересчета = ЗакупаемыеТовары.НайтиСтроки(СтрОтбора);
		Если СтрокиДляПересчета.Количество() Тогда
			СтрокаПересчета = СтрокиДляПересчета[0];
			ТекСтрока.КоличествоПриведенное = ТекСтрока.Количество * СтрокаПересчета.Количество;
		КонецЕсли;
		Количество = 0;
		СпрСсылка = Справочники.ЗакупкаТоваровВРазрезеГозКонтракта.НайтиПоРеквизиту("ПриобретениеТоваровУслуг", ТекСтрока.ПоступлениеТоваров);	
		Если Не СпрСсылка.Пустая() Тогда
			НСтроки = СпрСсылка.Товары.Выгрузить().НайтиСтроки(СтрОтбора);
			Если НСтроки.Количество() Тогда
				Для Каждого НСтрока Из НСтроки Цикл
					Количество = НСтрока.КоличествоРаспределено + Количество;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		ТекСтрока.УжеРаспределено = Количество;
	КонецЦикла;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЗакупкаТоваровВРазрезеГозКонтрактаТовары.КоличествоРаспределено) КАК КоличествоРаспределено,
	|	ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Документ КАК Документ
	|ИЗ
	|	Справочник.ЗакупкаТоваровВРазрезеГозКонтракта.Товары КАК ЗакупкаТоваровВРазрезеГозКонтрактаТовары
	|ГДЕ
	|	ЗакупкаТоваровВРазрезеГозКонтрактаТовары.НоменклатураПриведеная = &НоменклатураПриведеная
	|	И ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Документ В(&Документ)
	|	И ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Документ";
	
	Запрос.УстановитьПараметр("Документ", ДокументыСборки.Выгрузить().ВыгрузитьКолонку("Сборка"));
	Запрос.УстановитьПараметр("НоменклатураПриведеная", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрОтбора = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    СтрОтбора.Вставить("Сборка", ВыборкаДетальныеЗаписи.Документ);
		НСтроки = ДокументыСборки.НайтиСтроки(СтрОтбора);
		Если НСтроки.Количество() Тогда
			НСтроки[0].Распределено = ВыборкаДетальныеЗаписи.КоличествоРаспределено;
			ИтогоРаспределено = ВыборкаДетальныеЗаписи.КоличествоРаспределено + ИтогоРаспределено;
		КонецЕсли;
	КонецЦикла;
	
	Распределить = ИтогоПоСборке - ИтогоРаспределено;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументыСборки(Команда)
	ЗаполнитьДокументыСборкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыПоступленияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументыПоступления(Команда)
	ЗаполнитьДокументыПоступленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределитьНаСервере()
	
	Для Каждого СтрокаЗакупки Из ДокументыЗакупки Цикл
		Пока СтрокаЗакупки.КоличествоРаспределить > 0 Цикл
			СпрСсылка = Справочники.ЗакупкаТоваровВРазрезеГозКонтракта.НайтиПоРеквизиту("ПриобретениеТоваровУслуг", СтрокаЗакупки.ПоступлениеТоваров);
			Если СпрСсылка.Пустая() Тогда
				СпрОб = Справочники.ЗакупкаТоваровВРазрезеГозКонтракта.СоздатьЭлемент();
			Иначе 
				СпрОб = СпрСсылка.ПолучитьОбъект();
			КонецЕсли;
			СпрОб.ПриобретениеТоваровУслуг = СтрокаЗакупки.ПоступлениеТоваров; 
			БылоИзменение = Ложь;
			Для Каждого ТекСтрока Из ДокументыСборки Цикл
				Если ТекСтрока.Количество - ТекСтрока.Распределено > 0 Тогда
					КРаспределению = ТекСтрока.Количество - ТекСтрока.Распределено;
					КоличествоКРаспределению = ?(КРаспределению >= СтрокаЗакупки.КоличествоРаспределить, СтрокаЗакупки.КоличествоРаспределить, КРаспределению);
					СтрокаЗакупки.КоличествоРаспределить = СтрокаЗакупки.КоличествоРаспределить - КоличествоКРаспределению;
					НоваяСтрока = СпрОб.Товары.Добавить();
					НоваяСтрока.Номенклатура = СтрокаЗакупки.Номенклатура;
					НоваяСтрока.НоменклатураПриведеная = Номенклатура;
					НоваяСтрока.КоличествоПриведенное = СтрокаЗакупки.КоличествоПриведенное;
					НоваяСтрока.КоличествоРаспределено = КоличествоКРаспределению;
					НоваяСтрока.Документ = ТекСтрока.Сборка;
					НоваяСтрока.ГозКонтракт = ТекСтрока.Сборка.ГозКонтракт;
					НоваяСтрока.Количество = СтрокаЗакупки.Количество;
					БылоИзменение = Истина;
				КонецЕсли;
			КонецЦикла;	
			СпрОб.Записать();
			Если Не БылоИзменение Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументыРеализации(Команда)
	ЗаполнитьДокументыРеализацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыРеализацииНаСервере()
		
	ИтогоРаспределено = 0;
	ИтогоПоСборке = 0;
	Распределить = 0;
		
		Запрос8 = Новый Запрос("
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Сборка,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
		|	РеализацияТоваровУслугТовары.Количество КАК Количество,
		|	РеализацияТоваровУслугТовары.Ссылка.ГозКонтракт КАК ГозКонтракт
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура 
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
		|	И РеализацияТоваровУслугТовары.Ссылка.ГозКонтракт = &ГозКонтракт
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка.Дата");	
		
		Запрос8.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Если ЗначениеЗаполнено(Контракт) Тогда
			Запрос8.УстановитьПараметр("ГозКонтракт", Контракт);
		Иначе 
			Запрос8.Текст = СтрЗаменить(Запрос8.Текст, "РеализацияТоваровУслугТовары.Ссылка.ГозКонтракт = &ГозКонтракт", "ИСТИНА");
		КонецЕсли; 	
			
	ДокументыСборки.Загрузить(Запрос8.Выполнить().Выгрузить());
	
	ИтогоПоСборке = ДокументыСборки.Итог("Количество");
	
	Запрос8.Текст = 
	"ВЫБРАТЬ
	|	СборкаТоваровТовары.Ссылка.Номенклатура КАК Номенклатура,
	|	СборкаТоваровТовары.Ссылка.ВариантКомплектации КАК ВариантКомплектации
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
	|ГДЕ
	|	СборкаТоваровТовары.Номенклатура = &Номенклатура
	|	И СборкаТоваровТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров)
	|	И СборкаТоваровТовары.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаТоваровТовары.Ссылка.Номенклатура,
	|	СборкаТоваровТовары.Ссылка.ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
	|	ВремТаб.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВремТаб КАК ВремТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВремТаб.ВариантКомплектации = ВариантыКомплектацииНоменклатурыТовары.Ссылка
	|ГДЕ
	|	НЕ ВариантыКомплектацииНоменклатурыТовары.Количество ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремТаб.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество";
	
	ЗакупаемыеТовары.Загрузить(Запрос8.Выполнить().Выгрузить());
	
	Запрос8.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК ПоступлениеТоваров,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Количество КАК Количество
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Номенклатура В(&Номенклатура)
	|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Ссылка.Дата";
	
	ТабЗнач = ЗакупаемыеТовары.Выгрузить();
	
	Если ЗначениеЗаполнено(ТабЗнач) Тогда
		
		Запрос8.УстановитьПараметр("Номенклатура", ЗакупаемыеТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура")); 
		
	Иначе 
		
		Запрос8.УстановитьПараметр("Номенклатура", Номенклатура);
		
	КонецЕСли;
	
	ДокументыЗакупки.Загрузить(Запрос8.Выполнить().Выгрузить());
	
	СтрОтбора = Новый Структура;
	
	Для Каждого ТекСтрока Из ДокументыЗакупки Цикл
		СтрОтбора.Вставить("Номенклатура", ТекСтрока.Номенклатура);
		СтрокиДляПересчета = ЗакупаемыеТовары.НайтиСтроки(СтрОтбора);
		Если СтрокиДляПересчета.Количество() Тогда
			СтрокаПересчета = СтрокиДляПересчета[0];
			ТекСтрока.КоличествоПриведенное = ТекСтрока.Количество * СтрокаПересчета.Количество;
		КонецЕсли;
		Количество = 0;
		СпрСсылка = Справочники.ЗакупкаТоваровВРазрезеГозКонтракта.НайтиПоРеквизиту("ПриобретениеТоваровУслуг", ТекСтрока.ПоступлениеТоваров);	
		Если Не СпрСсылка.Пустая() Тогда
			НСтроки = СпрСсылка.Товары.Выгрузить().НайтиСтроки(СтрОтбора);
			Если НСтроки.Количество() Тогда
				Для Каждого НСтрока Из НСтроки Цикл
					Количество = НСтрока.КоличествоРаспределено + Количество;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		ТекСтрока.УжеРаспределено = Количество;
	КонецЦикла;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЗакупкаТоваровВРазрезеГозКонтрактаТовары.КоличествоРаспределено) КАК КоличествоРаспределено,
	|	ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Документ КАК Документ
	|ИЗ
	|	Справочник.ЗакупкаТоваровВРазрезеГозКонтракта.Товары КАК ЗакупкаТоваровВРазрезеГозКонтрактаТовары
	|ГДЕ
	|	ЗакупкаТоваровВРазрезеГозКонтрактаТовары.НоменклатураПриведеная = &НоменклатураПриведеная
	|	И ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Документ В(&Документ)
	|	И ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Документ";
	
	Запрос.УстановитьПараметр("Документ", ДокументыСборки.Выгрузить().ВыгрузитьКолонку("Сборка"));
	Запрос.УстановитьПараметр("НоменклатураПриведеная", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрОтбора = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    СтрОтбора.Вставить("Сборка", ВыборкаДетальныеЗаписи.Документ);
		НСтроки = ДокументыСборки.НайтиСтроки(СтрОтбора);
		Если НСтроки.Количество() Тогда
			НСтроки[0].Распределено = ВыборкаДетальныеЗаписи.КоличествоРаспределено;
			ИтогоРаспределено = ВыборкаДетальныеЗаписи.КоличествоРаспределено + ИтогоРаспределено;
		КонецЕсли;
	КонецЦикла;
	
	Распределить = ИтогоПоСборке - ИтогоРаспределено;
	
КонецПроцедуры
