
&Вместо("ТекстЗапросаТаблицаТоварыОрганизаций")
Функция Buro1Goz_ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет и ДокументОбъект.НеЗаписыватьСебестИТовОрг = Истина тогда
		Возврат "";
	КонецЕсли;
	
	// продолжает выполнять код из основной конфы
	Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	Возврат Результат;
КонецФункции

//&Вместо("ТекстЗапросаТаблицаСебестоимостьТоваров")
//Функция Buro1Goz_ТекстЗапросаТаблицаСебестоимостьТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
//	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет и ДокументОбъект.НеЗаписыватьСебестИТовОрг = Истина тогда
//		Возврат "";
//	КонецЕсли;
//	
//	// продолжает выполнять код из основной конфы
//	Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
//	Возврат Результат;
//КонецФункции

&Вместо("ДанныеДокументаДляПроведения")
Функция Buro1Goz_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(Документ, Регистры, ДопПараметры);
	Попытка
		Если Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет и Документ.НеЗаписыватьСебестИТовОрг = Истина тогда
			Результат.Удалить("ТаблицаСебестоимостьТоваров");
		КонецЕсли;
    Исключение
	КонецПопытки;
	Возврат Результат;
КонецФункции
