
&Вместо("ИндексТиповСвязанныхОбъектов")
Функция Buro1Goz_ИндексТиповСвязанныхОбъектов()
	
	ИндексТипов = ПродолжитьВызов();
	
	ДобавленныеТипы = ОбщегоНазначения.ВыгрузитьКолонку(Buro1Goz_ПолучитьДанныеСвязанныхДокументов(), "Тип");
	Для каждого Тип Из ДобавленныеТипы Цикл
		ИндексТипов.Вставить(Тип, Истина);
	КонецЦикла;
	
	Возврат ИндексТипов;
	
КонецФункции

Функция Buro1Goz_ПолучитьДанныеСвязанныхДокументов() Экспорт

	СоставСвязанныеДокументы = Buro1Goz_СоставСвязанныеДокументы();
	ДанныеСвязанныхДокументов = Новый Массив;
	Для каждого ОбъектМетаданных Из СоставСвязанныеДокументы Цикл
		
		ОбъектМетаданныхПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		МетаданныеДерево = СтрРазделить(ОбъектМетаданныхПолноеИмя, ".");
		Тип = Тип(МетаданныеДерево[0] + "Ссылка." + МетаданныеДерево[1]);
		
		ДанныеСвязанныхДокументов.Добавить(Новый Структура("Тип, ПолноеИмя", Тип, ОбъектМетаданныхПолноеИмя));
	
	КонецЦикла;
	
	Возврат ДанныеСвязанныхДокументов;

КонецФункции

Функция Buro1Goz_СоставСвязанныеДокументы()

	ОбъектыМетаданных = Новый Массив;
	ОбъектыМетаданных.Добавить(Метаданные.Документы.ПриобретениеУслугПрочихАктивов.Реквизиты.Buro1Goz_ЗаказПоставщику);
	
	Возврат ОбъектыМетаданных;

КонецФункции