
&НаСервере
Процедура ПроставитьПризнакНеВыгружатьвВБПВПермещенияхНаСервере()
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ
	//|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
	//|	СУММА(ВЫБОР
	//|			КОГДА ПеремещениеТоваровТовары.НеВыгружатьВБП
	//|				ТОГДА 1
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК НеВыгружатьВБП,
	//|	МАКСИМУМ(ПеремещениеТоваровТовары.НомерСтроки) КАК НомерСтроки
	//|ПОМЕСТИТЬ ВременнаяТаблица
	//|ИЗ
	//|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	//|ГДЕ
	//|	ПеремещениеТоваровТовары.Ссылка.Дата >= &Дата
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПеремещениеТоваровТовары.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВременнаяТаблица.Ссылка КАК Ссылка
	//|ИЗ
	//|	ВременнаяТаблица КАК ВременнаяТаблица
	//|ГДЕ
	//|	ВременнаяТаблица.НеВыгружатьВБП > 0
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ВременнаяТаблица.Ссылка.Дата");
	//
	//Запрос.УстановитьПараметр("Дата", НачалоДня(СтПериод.ДатаНачала));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	//	Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
	//		СтрокаТовары.НеВыгружатьВБП = Ложь;
	//	КонецЦикла;               
	//	ДокументОбъект.Записать();
	//КонецЦикла;
	
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	СборкаТоваров.ВариантКомплектации КАК ВариантКомплектации
	|ПОМЕСТИТЬ ВТ_ВариантыКомплектации
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|ГДЕ
	|	СборкаТоваров.Проведен = ИСТИНА
	|	И СборкаТоваров.Дата >= &Дата0105
	|	И СборкаТоваров.ВариантКомплектации ССЫЛКА Справочник.ВариантыКомплектацииНоменклатуры
	|	И СборкаТоваров.ВариантКомплектации <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаТоваров.ВариантКомплектации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВТ_ВариантыКомплектации КАК ВТ_ВариантыКомплектации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.КомплектующиеУправленческие КАК ВариантыКомплектацииНоменклатурыТовары
	|		ПО ВТ_ВариантыКомплектации.ВариантКомплектации = ВариантыКомплектацииНоменклатурыТовары.Ссылка
	|ГДЕ
	|	НЕ ВариантыКомплектацииНоменклатурыТовары.Номенклатура ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОбороты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&НачПериода,
	|			,
	|			Регистратор,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТ_Товары.Номенклатура
	|				ИЗ
	|					ВТ_Товары)) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|	И ТоварыНаСкладахОбороты.Регистратор.НеВыгружатьВБП = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары");
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(СтПериод.ДатаНачала));
	Запрос.УстановитьПараметр("Дата0105", '20250501');
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТабТовары = РезультатЗапроса[3].Выгрузить();
	ТабДокументы = РезультатЗапроса[2].Выгрузить();
	
	Для Каждого ТекСтрока Из ТабДокументы Цикл
		ДокументОбъект = ТекСтрока.Регистратор.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		КоличествоНеВыгружатьВБП = 0;
		Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
			СтрОтбора = Новый Структура;
			СтрОтбора.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
			НСтроки = ТабТовары.НайтиСтроки(СтрОтбора);
			Если НСтроки.Количество() Тогда
				СтрокаТовары.НеВыгружатьВБП = Истина;
				КоличествоНеВыгружатьВБП = КоличествоНеВыгружатьВБП + 1;
			КонецЕсли;
		КонецЦикла;               
		Если КоличествоНеВыгружатьВБП = ДокументОбъект.Товары.Количество() Тогда
			ДокументОбъект.НеВыгружатьВБП = Истина;
		КонецЕсли;
		ДокументОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПризнакНеВыгружатьвВБПВПермещениях(Команда)
	ПроставитьПризнакНеВыгружатьвВБПВПермещенияхНаСервере();
КонецПроцедуры












