
&ИзменениеИКонтроль("ВыгрузкаОбъектаВыборки")
Процедура Buro1Goz_ВыгрузкаОбъектаВыборки(КомпонентыОбмена, Объект, ПравилоОбработки)

	ОбъектСсылочногоТипа = (ТипЗнч(Объект) <> Тип("Структура"))
	И ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(Объект.Метаданные());

	Если (ТипЗнч(Объект) <> Тип("Структура"))
		И ПравилоОбработки = Неопределено Тогда
		ПолучитьПравилоОбработкиДляОбъекта(КомпонентыОбмена, Объект, ПравилоОбработки);
	КонецЕсли;

	КомпонентыОбмена.ВыгруженныеОбъекты.Добавить(?(ОбъектСсылочногоТипа, Объект.Ссылка, Объект));

	// Отработка ПОД
	ИспользованиеПКО = Новый Структура;
	Для Каждого ТекущееПКО Из ПравилоОбработки.ИспользуемыеПКО Цикл
		ИспользованиеПКО.Вставить(ТекущееПКО, Истина);
	КонецЦикла;
	
	#Вставка
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПеремещениеТоваров")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.КорректировкаТоваровБухгалтерии") Тогда

		Если Объект.НеВыгружатьВБП Тогда
		
			Возврат;	
		
		КонецЕсли; 	
	
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.СчетФактураВыданный")
		И ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда

		Если Объект.ДокументОснование.НеВыгружатьВБП Тогда
		
			Возврат;	
		
		КонецЕсли; 	
	
	КонецЕсли;
	#КонецВставки
	
	ПрерватьОбработку = Ложь;
	ВзвестиФлагОшибки = Ложь;

	ПриОбработкеПОД(
	КомпонентыОбмена,
	ПравилоОбработки,
	Объект,
	ИспользованиеПКО,
	ПрерватьОбработку);

	Если ПрерватьОбработку Тогда
		ВзвестиФлагОшибки = Истина;
	КонецЕсли;

	Если Не ПрерватьОбработку Тогда
		// Отработка ПКО
		НесколькоПКО = (ИспользованиеПКО.Количество() > 1);
		ЕстьКолонкаОчисткаДанных = КомпонентыОбмена.ПравилаОбработкиДанных.Колонки.Найти("ОчисткаДанных") <> Неопределено;

		Для Каждого ТекущееПКО Из ИспользованиеПКО Цикл
			ПравилоКонвертации = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти(ТекущееПКО.Ключ, "ИмяПКО");
			Если ПравилоКонвертации = Неопределено Тогда
				// Допустимо указание ПКО, не предназначенного для текущей версии формата данных.
				Продолжить;
			КонецЕсли;

			Если Не ОбъектФорматаПроходитПоФильтруXDTO(КомпонентыОбмена, ПравилоКонвертации.ОбъектФормата) Тогда
				Продолжить;
			КонецЕсли;

			Если Не ТекущееПКО.Значение Тогда
				// Если правил конвертации несколько, и некоторые из них не используются -
				// необходимо выгрузить удаление объекта на случай если  ранее он был выгружен по этим правилам.
				Если НесколькоПКО
					И ОбъектСсылочногоТипа 
					И (Не ЕстьКолонкаОчисткаДанных
					Или ПравилоОбработки.ОчисткаДанных) Тогда
					ВыгрузитьУдаление(КомпонентыОбмена, Объект.Ссылка, ПравилоКонвертации);
				КонецЕсли;
				Продолжить;
			КонецЕсли;

			ПропуститьОбработку = Ложь;
			Попытка
				// 2. Конвертируем Данные в Структуру по правилам конвертации.
				ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();

				ДанныеXDTO = ДанныеXDTOИзДанныхИБ(КомпонентыОбмена, Объект, ПравилоКонвертации, Неопределено);

				Событие = "ДанныеXDTOИзДанныхИБ." + ПравилоКонвертации.ИмяПКО;
				ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
				ВремяНачала, Событие, Объект, КомпонентыОбмена,
				ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека());

				Если ДанныеXDTO = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				// 3. Конвертируем Структуру в ОбъектXDTO.
				ВремяНачала = ОбменДаннымиОценкаПроизводительности.НачатьЗамер();

				СсылкиИзОбъекта = Новый Массив;
				ОбъектXDTO = ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, ДанныеXDTO, ПравилоКонвертации.ТипXDTO, СсылкиИзОбъекта, , ПравилоКонвертации.Расширения);

				Событие = "ОбъектXDTOИзДанныхXDTO." + ПравилоКонвертации.ИмяПКО;
				ОбменДаннымиОценкаПроизводительности.ЗавершитьЗамер(
				ВремяНачала, Событие, Объект, КомпонентыОбмена, 
				ОбменДаннымиОценкаПроизводительности.ТипСобытияБиблиотека());

			Исключение
				ПропуститьОбработку = Истина;
				ВзвестиФлагОшибки   = Истина;

				ОписаниеОшибки = ОписаниеОшибкиПКО(
				КомпонентыОбмена.НаправлениеОбмена,
				ПравилоОбработки.Имя,
				ПравилоКонвертации.ИмяПКО,
				ПредставлениеОбъектаДляПротокола(Объект, ПравилоКонвертации.ОбъектДанных),
				ИнформацияОбОшибке());

				ЗафиксироватьПроблемуПриОбработкеОбъекта(КомпонентыОбмена,
				Объект,
				Перечисления.ТипыПроблемОбменаДанными.ОшибкаВыполненияКодаОбработчиковПриОтправкеДанных,
				ОписаниеОшибки.ПодробноеПредставление,
				ОписаниеОшибки.КраткоеПредставление);
			КонецПопытки;

			Если Не ПропуститьОбработку Тогда
				ОшибкаПроверкиПоСхеме = Ложь;
				ОписаниеОшибкиПроверкиПоСхеме = Неопределено;

				Контекст = Новый Структура;
				Контекст.Вставить("НаправлениеОбмена",    КомпонентыОбмена.НаправлениеОбмена);
				Контекст.Вставить("ИмяПОД",               ПравилоОбработки.Имя);
				Контекст.Вставить("ИмяПКО",               ПравилоКонвертации.ИмяПКО);
				Контекст.Вставить("ПредставлениеОбъекта", ПредставлениеОбъектаДляПротокола(Объект, ПравилоКонвертации.ОбъектДанных));

				ПроверитьОбъектXDTOПоСхеме(ОбъектXDTO, ПравилоКонвертации.ТипXDTO, Контекст, ОшибкаПроверкиПоСхеме, ОписаниеОшибкиПроверкиПоСхеме);

				Если ОшибкаПроверкиПоСхеме Тогда
					ПропуститьОбработку = Истина;

					ЗафиксироватьПроблемуПриОбработкеОбъекта(КомпонентыОбмена,
					Объект,
					Перечисления.ТипыПроблемОбменаДанными.ОшибкаПроверкиСконвертированногоОбъекта,
					ОписаниеОшибкиПроверкиПоСхеме.ПодробноеПредставление,
					ОписаниеОшибкиПроверкиПоСхеме.КраткоеПредставление);
				КонецЕсли;
			КонецЕсли;

			Если ПропуститьОбработку Тогда
				ПрерватьОбработку = Истина;
				Продолжить;
			КонецЕсли;

			ВыгрузитьОбъектыПоСсылке(КомпонентыОбмена, СсылкиИзОбъекта);

			// 4. Записываем ОбъектXDTO в XML-файл.
			ФабрикаXDTO.ЗаписатьXML(КомпонентыОбмена.ФайлОбмена, ОбъектXDTO);
		КонецЦикла;
	КонецЕсли;

	Если ПрерватьОбработку Тогда
		КомпонентыОбмена.НеВыгруженныеОбъекты.Добавить(?(ОбъектСсылочногоТипа, Объект.Ссылка, Объект));
	КонецЕсли;

	Если ВзвестиФлагОшибки Тогда
		КомпонентыОбмена.ФлагОшибки = Истина;
		КомпонентыОбмена.СостояниеОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Ошибка;
	КонецЕсли;

КонецПроцедуры
