
&После("ОбработкаПроведения")
Процедура Buro1Goz_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не Отказ Тогда
		НаборЗаписей = РегистрыНакопления.УчетШтрихКодов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		Если ПечатьСерийныхНомеровИзПула Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СерийныеНомераНаПечать.СерийныйНомер КАК СерийныйНомер
			|ИЗ
			|	РегистрСведений.СерийныеНомераНаПечать КАК СерийныеНомераНаПечать
			|ГДЕ
			|	СерийныеНомераНаПечать.Реализация = &Реализация";
			Запрос.УстановитьПараметр("Реализация", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.Период = Дата;
				НоваяСтрока.СерийныйНомер = ВыборкаДетальныеЗаписи.СерийныйНомер;
				НоваяСтрока.Регистратор = Ссылка;
			КонецЦикла;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	B1_ОбщегоНазначения.ДвиженияТоваровБухгалтерии(Отказ, ЭтотОбъект, "Товары");
	
КонецПроцедуры
