Функция Печать(СтруктураДляПечати) Экспорт
	
	Попытка 
		
		ТабДок = ЗаполнитьМакетНаСервере(СтруктураДляПечати);
		
		Возврат ТабДок;
		
	Исключение
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ПечатьМакетаЗОВ",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось заполнить макет " + ОписаниеОшибки());	
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

Функция ЗаполнитьМакетНаСервере(СтруктураДляПечати)
	
	ТабДок = новый табличныйдокумент;   
	
	Макет = Обработки.ПечатьСерийныхНомеров.ПолучитьМакет("Макет"); 
	
	Если СтруктураДляПечати.МассивСН.Количество() = 0 тогда
		
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ПечатьМакетаЗОВ", УровеньЖурналаРегистрации.Ошибка, , ,"Нет серийных номеров изделий. Печать не произведена!");
		
		Возврат Неопределено;
		
	Иначе
		
		Если СтруктураДляПечати.принтер = "" тогда
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ПечатьМакетаЗОВ", УровеньЖурналаРегистрации.Предупреждение, , ,"Не заполнен принтер, печатаем на принтер по умолчанию");	
			
			Возврат Неопределено;
			
		Иначе	
			
			Для каждого СтруктураСерийногоНомера из СтруктураДляПечати.МассивСН Цикл
				
				Если ЗначениеЗаполнено(СтруктураСерийногоНомера.ИмяМакета) Тогда
					
					Попытка 
						
						Макет = Обработки.ПечатьСерийныхНомеров.ПолучитьМакет(СтруктураСерийногоНомера.ИмяМакета);
						
					Исключение
						
						ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ПечатьМакетаЗОВ", УровеньЖурналаРегистрации.Предупреждение, , ,"Указано не верное имя макета """ + СтруктураСерийногоНомера.ИмяМакета + """");	
			
						Возврат Неопределено;
						
					КонецПопытки;						
				КонецЕсли;	
				//Иначе
					
					Область = Макет.ПолучитьОбласть("Область|Область1");  
					
					Если СтруктураСерийногоНомера.ИмяМакета = "Макет1" Тогда
						
						ЗаполнитьКуар("H245v111-v3-" + СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
						
					ИначеЕсли СтруктураСерийногоНомера.ИмяМакета = "Макет6S12Ah" ИЛИ СтруктураСерийногоНомера.ИмяМакета = "Макет8S16Ah" Тогда
						
						ЗаполнитьКуар(СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
						
					ИначеЕсли СтруктураСерийногоНомера.ИмяМакета = "МакетОптоволокно1" Тогда
						
						ЗаполнитьКуар(СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
						
						НайденноеТире = СтрНайти(СтруктураСерийногоНомера.СерийныйНомер, "-", НаправлениеПоиска.СНачала);
						
						Если НайденноеТире Тогда
						
							Область.Параметры.Префикс = Лев(СтруктураСерийногоНомера.СерийныйНомер, НайденноеТире - 1);	
						
						КонецЕсли;                                                                                     				
						
					ИначеЕсли СтруктураСерийногоНомера.ИмяМакета = "МакетОптоволокно" Тогда
						
						ЗаполнитьКуар(СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
						
						НайденноеТире = СтрНайти(СтруктураСерийногоНомера.СерийныйНомер, "-", НаправлениеПоиска.СНачала);
						
						Если НайденноеТире Тогда
						
							Область.Параметры.Префикс = Лев(СтруктураСерийногоНомера.СерийныйНомер, НайденноеТире - 1);	
						
						КонецЕсли;
						
					Иначе	
						
						ЗаполнитьКуар("H231v111-v3-" + СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
						
					КонецЕсли;
					
					Если СтруктураСерийногоНомера.ИмяМакета = "МакетОптоволокно" Тогда
						
						ЗаполнитьШК1Горизонтально(СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
						ЗаполнитьШК2Горизонтально(СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
					
					Иначе	
					
						ЗаполнитьШК1(СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
						ЗаполнитьШК2(СтруктураСерийногоНомера.СерийныйНомер, Область, Макет);
					
					КонецЕсли;
					
					Область.Параметры.SN = СтруктураСерийногоНомера.СерийныйНомер;
					
					Для К = 1 по СтруктураДляПечати.Копий Цикл 
						
						ТабДок.Вывести(Область); 
						ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
						
					КонецЦикла;
					
				//КонецЕсли;
				
			КонецЦикла;
			
			ТабДок.РазмерКолонтитулаСверху = 0;
			ТабДок.РазмерКолонтитулаСнизу = 0;
			
			ТабДок.ПолеСверху = 0;
			ТабДок.ПолеСнизу = 0; 
			ТабДок.ПолеСлева = 0;
			ТабДок.ПолеСправа = 0;
			
			ТабДок.АвтоМасштаб = Истина; 
			
			Возврат ТабДок;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции 

&НаСервере    
Процедура ЗаполнитьКуар(ЗначениеДМ, ОбластьТовар, МакетОбработки)
	
	ПараметрыQRШтрихкода = Новый Структура;
	
	ПараметрыQRШтрихкода.Вставить("Штрихкод", "");
	ПараметрыQRШтрихкода.Вставить("ВериткальноеВыравнивание", 1);
	ПараметрыQRШтрихкода.Вставить("УголПоворота", 270);
	ПараметрыQRШтрихкода.Вставить("Ширина", 3);
	ПараметрыQRШтрихкода.Вставить("Высота", 3);
	ПараметрыQRШтрихкода.Вставить("ТипВходныхДанных", 0);
	ПараметрыQRШтрихкода.Вставить("АвтоТип", ЛОЖЬ);
	ПараметрыQRШтрихкода.Вставить("ТипКода", 20);
	ПараметрыQRШтрихкода.Вставить("ОтображатьТекст", Ложь);
	
	КоличествоМиллиметровВПикселе = МакетОбработки.Рисунки.QR.Высота / 100;
	
	ПараметрыQRШтрихкода.Штрихкод = ЗначениеДМ;
	ПараметрыQRШтрихкода.Ширина = Окр(ОбластьТовар.Рисунки.QR.Ширина*3.3);
	ПараметрыQRШтрихкода.Высота = Окр(ОбластьТовар.Рисунки.QR.Высота*3.3);
	
	ПараметрыQRШтрихкода.Ширина = 100;
	ПараметрыQRШтрихкода.Высота = 100;
	
	РезультатГенерацииШтрихкода = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыQRШтрихкода);
	
	Если  РезультатГенерацииШтрихкода.ДвоичныеДанные <> Неопределено Тогда
		ОбластьТовар.Рисунки.QR.Картинка =  РезультатГенерацииШтрихкода.Картинка;
	КонецЕсли; 
	
КонецПроцедуры	    

&НаСервере
Процедура ЗаполнитьШК1Горизонтально(ЗначениеДМ, ОбластьТовар, МакетОбработки)
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Штрихкод", ЗначениеДМ);
	ПараметрыШтрихкода.Вставить("УголПоворота", 270);
	ПараметрыШтрихкода.Вставить("АвтоТип", ЛОЖЬ);
	ПараметрыШтрихкода.Вставить("Ширина", 200);
	ПараметрыШтрихкода.Вставить("Высота", 200);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0);
	ПараметрыШтрихкода.Вставить("ТипКода", 2); //4
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
		
	РезультатОперации = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Если РезультатОперации.ДвоичныеДанные <> Неопределено Тогда
		ОбластьТовар.Рисунки.ШК1.Картинка = РезультатОперации.Картинка;
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьШК2Горизонтально(ЗначениеДМ, ОбластьТовар, МакетОбработки)
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Штрихкод", ЗначениеДМ);
	ПараметрыШтрихкода.Вставить("УголПоворота", 270);
	ПараметрыШтрихкода.Вставить("АвтоТип", ЛОЖЬ);
	ПараметрыШтрихкода.Вставить("Ширина", 200);
	ПараметрыШтрихкода.Вставить("Высота", 200);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0);
	ПараметрыШтрихкода.Вставить("ТипКода", 2); //4
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	
	РезультатОперации = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Если РезультатОперации.ДвоичныеДанные <> Неопределено Тогда
		ОбластьТовар.Рисунки.ШК2.Картинка = РезультатОперации.Картинка;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШК1(ЗначениеДМ, ОбластьТовар, МакетОбработки)
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Штрихкод", "");
	ПараметрыШтрихкода.Вставить("УголПоворота", 270);
	ПараметрыШтрихкода.Вставить("АвтоТип", ЛОЖЬ);
	ПараметрыШтрихкода.Вставить("Ширина", 3);
	ПараметрыШтрихкода.Вставить("Высота", 3);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0);
	ПараметрыШтрихкода.Вставить("ТипКода", 20); //4
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		
	КоличествоМиллиметровВПикселе = МакетОбработки.Рисунки.ШК1.Высота / 100;
	
	ПараметрыШтрихкода.Штрихкод = ЗначениеДМ;
	ПараметрыШтрихкода.Ширина = Окр(ОбластьТовар.Рисунки.ШК1.Ширина / (КоличествоМиллиметровВПикселе * 1.4));
	ПараметрыШтрихкода.Высота = Окр(ОбластьТовар.Рисунки.ШК1.Высота / (КоличествоМиллиметровВПикселе * 1.4));
	
	ПараметрыШтрихкода.Ширина = 100;  //1 //40 //50   //40
	ПараметрыШтрихкода.Высота = 100; //125 //125 //150 //350
	
	
	РезультатОперации = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Если РезультатОперации.ДвоичныеДанные <> Неопределено Тогда
		ОбластьТовар.Рисунки.ШК1.Картинка = РезультатОперации.Картинка;
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьШК2(ЗначениеДМ, ОбластьТовар, МакетОбработки)
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Штрихкод", "");
	ПараметрыШтрихкода.Вставить("УголПоворота", 270);
	ПараметрыШтрихкода.Вставить("АвтоТип", ЛОЖЬ);
	ПараметрыШтрихкода.Вставить("Ширина", 3); 
	ПараметрыШтрихкода.Вставить("Высота", 3);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0);
	ПараметрыШтрихкода.Вставить("ТипКода", 20); //4
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
	
	КоличествоМиллиметровВПикселе = МакетОбработки.Рисунки.ШК2.Высота / 100;
	
	ПараметрыШтрихкода.Штрихкод = ЗначениеДМ;
	ПараметрыШтрихкода.Ширина = Окр(ОбластьТовар.Рисунки.ШК2.Ширина / (КоличествоМиллиметровВПикселе * 1.4));
	ПараметрыШтрихкода.Высота = Окр(ОбластьТовар.Рисунки.ШК2.Высота / (КоличествоМиллиметровВПикселе * 1.4));
	
	ПараметрыШтрихкода.Ширина = 100;  //40
	ПараметрыШтрихкода.Высота = 100; //350
	
	ПараметрыШтрихкода.ТипВходныхДанных = 0;
	
	РезультатОперации = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Если РезультатОперации.ДвоичныеДанные <> Неопределено Тогда
		ОбластьТовар.Рисунки.ШК2.Картинка = РезультатОперации.Картинка;
	КонецЕсли;

КонецПроцедуры	