&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомераНаПечатьСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|	1 КАК Количество
		|ИЗ
		|	РегистрСведений.СерийныеНомераНаПечать.СрезПоследних(, ) КАК СерийныеНомераНаПечатьСрезПоследних
		|ГДЕ
		|	СерийныеНомераНаПечатьСрезПоследних.Реализация = &Реализация";
		Запрос.УстановитьПараметр("Реализация", Объект.Ссылка);
		СерийныеНомера.Загрузить(Запрос.Выполнить().Выгрузить());
		ВсегоСерийныхНомеров = СерийныеНомера.Количество();
		
	КонецЕсли;
	
	//Элементы.СтраницаСерийныеНомера.Заголовок = СтрШаблон("Серийные номера (%1)", СтрЗаменить(ВсегоСерийныхНомеров, Символы.НПП, ""));

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Buro1Goz_СгенерироватьСерийныеНомераВместо(Команда)
	Buro1Goz_СгенерироватьСерийныеНомераНаСервереВместо();
КонецПроцедуры

&НаСервере
Процедура Buro1Goz_СгенерироватьСерийныеНомераНаСервереВместо()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Сообщить("Предварительно необходимо записать документ!");
		Возврат;	
	
	КонецЕсли;
	
	ИмяМакета = "";
	
	ЗапросНоменклатурыСканирования = Новый Запрос("
	|ВЫБРАТЬ
	|   НастройкаСобственныхСерийныхНомеров.Префикс КАК Префикс,
	|   НастройкаСобственныхСерийныхНомеров.ОбщаяДлинаКода КАК ОбщаяДлинаКода,
	|   НастройкаСобственныхСерийныхНомеров.ПоследнийНомер КАК ПоследнийНомер,
	|	НастройкаСобственныхСерийныхНомеров.Номенклатура КАК Номенклатура,
	|	НастройкаСобственныхСерийныхНомеров.ИмяМакета КАК ИмяМакета
	|ИЗ
	|	РегистрСведений.НастройкаСобственныхСерийныхНомеров КАК НастройкаСобственныхСерийныхНомеров
	|ГДЕ
	|	НастройкаСобственныхСерийныхНомеров.Номенклатура В (&Номенклатура)");
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		
		Сообщить("Не указана номенклатура");
		Возврат;
		
	КонецЕсли;	
	
	МассивНом = Новый Массив;
	МассивНом.Добавить(Объект.Номенклатура);
	
	ЗапросНоменклатурыСканирования.УстановитьПараметр("Номенклатура", МассивНом);
	РезультатНоменклатурыСканирования = ЗапросНоменклатурыСканирования.Выполнить().Выгрузить();
	Если РезультатНоменклатурыСканирования.Количество() = 1 Тогда
		
		ИмяМакета = РезультатНоменклатурыСканирования[0].ИмяМакета; 
		
	Иначе	
		
		Сообщить("Не найдена настройка для номенклатуры сканирования: " + Объект.Номенклатура);
		Возврат;
		
	КонецЕсли;

	
	Если НЕ ЗначениеЗаполнено(ИмяМакета) Тогда
		
		Сообщить("Не установлено имя макета!");
		Возврат;	
		
	КонецЕсли;
	
	Если КоличествоГенерируемыхНомеров = 0 Тогда
	
		Сообщить("Укажите количество генерируемых серийных номеров!");
		Возврат;	
	
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Выборка	= РезультатНоменклатурыСканирования[0];	
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкаСобственныхСерийныхНомеров");
		ЭлементБлокировкиДанных.УстановитьЗначение("Номенклатура", Выборка.Номенклатура);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
						
		ПоследнийНомер = Выборка.ПоследнийНомер;
		
		НоваяЗапись = РегистрыСведений.НастройкаСобственныхСерийныхНомеров.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = Выборка.Номенклатура;
		НоваяЗапись.Прочитать();
		НоваяЗапись.ПоследнийНомер = ПоследнийНомер + КоличествоГенерируемыхНомеров;
		НоваяЗапись.Записать();
		
		Для Сч = 1 По КоличествоГенерируемыхНомеров Цикл
			
			ПоследнийНомер = ПоследнийНомер + 1;
			
			ДлинаБезПрефикса = Выборка.ОбщаяДлинаКода - СтрДлина(Выборка.Префикс);
			СформированныйСерийныйНомер = "" + Выборка.Префикс + Формат(ПоследнийНомер, "ЧЦ=" + ДлинаБезПрефикса + "; ЧВН=; ЧГ=0");
			
			ЗаписьПечати = РегистрыСведений.СерийныеНомераНаПечать.СоздатьМенеджерЗаписи();
			
			ЗаписьПечати.Период 		= ТекущаяДата();
			ЗаписьПечати.СерийныйНомер 	= СформированныйСерийныйНомер;
			ЗаписьПечати.Реализация 	= Объект.Ссылка;
			ЗаписьПечати.Количество		= 1;
			ЗаписьПечати.ИмяМакета 		= ИмяМакета;
			
			ЗаписьПечати.Записать();
			
		КонецЦикла; 			
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "" + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
		
	КонецПопытки;
		
	ОбновитьДанныеНаСервере();
	Модифицированность = Истина;

КонецПроцедуры // ()

