
&ИзменениеИКонтроль("ПроверитьЗаполнениеРеквизитовДереваДанных")
Процедура Buro1Goz_ПроверитьЗаполнениеРеквизитовДереваДанных(ДеревоДанных, Ошибки, ЭтоТаблица, НомерСтроки, ПроверятьОбязательностьПараметровОшибки, ДатаПоФорматуФНС)

	НомерСтрокиДляПодстановки = ?(ЭтоТаблица, НомерСтроки, Неопределено);
	СтрокаДерева = Неопределено; // в этой переменной будем хранить последнюю считанную строку дерева данных
	#Вставка 	
	//определение параметров поиска для Организации
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолныйПуть", "СведенияОПродавце.НомерСтроки.Адрес.АдресИнформация.КодСтраны");
	//поиск строк
	мНайдСтроки = ДеревоДанных.Строки.НайтиСтроки(ПараметрыПоиска);
	Если мНайдСтроки.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(мНайдСтроки[0].Значение) Тогда
			// Если не заполнено, то вставляем код России
			мНайдСтроки[0].Значение = "643";
		КонецЕсли;
	КонецЕсли; 
		
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолныйПуть", "СведенияОПродавце.НомерСтроки.Адрес.АдресИнформация.АдресТекст");
	//поиск строк
	мНайдСтроки = ДеревоДанных.Строки.НайтиСтроки(ПараметрыПоиска);
	Если мНайдСтроки.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(мНайдСтроки[0].Значение) Тогда
			// Если не заполнено, то вставляем код России
			мНайдСтроки[0].Значение = мНайдСтроки[0].КлючСообщения.КонтактнаяИнформация[0].Представление;
		КонецЕсли;
	КонецЕсли; 
	
	//определение параметров поиска для Грузополучателя
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолныйПуть", "СведенияОГрузополучателе.НомерСтроки.Адрес.АдресИнформация.КодСтраны");
	//поиск строк
	мНайдСтроки = ДеревоДанных.Строки.НайтиСтроки(ПараметрыПоиска);
	Если мНайдСтроки.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(мНайдСтроки[0].Значение) Тогда
			// Если не заполнено, то вставляем код России
			мНайдСтроки[0].Значение = "643";			
		КонецЕсли;
	КонецЕсли;

	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолныйПуть", "СведенияОГрузополучателе.НомерСтроки.Адрес.АдресИнформация.АдресТекст");
	//поиск строк
	мНайдСтроки = ДеревоДанных.Строки.НайтиСтроки(ПараметрыПоиска);
	Если мНайдСтроки.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(мНайдСтроки[0].Значение) Тогда
			// Если не заполнено, то вставляем код России
			мНайдСтроки[0].Значение = мНайдСтроки[0].КлючСообщения.КонтактнаяИнформация[0].Представление;
		КонецЕсли;
	КонецЕсли;
	
	//определение параметров поиска для Покупателя
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолныйПуть", "СведенияОПокупателе.НомерСтроки.Адрес.АдресИнформация.КодСтраны");
	//поиск строк
	мНайдСтроки = ДеревоДанных.Строки.НайтиСтроки(ПараметрыПоиска);
	Если мНайдСтроки.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(мНайдСтроки[0].Значение) Тогда
			// Если не заполнено, то вставляем код России
			мНайдСтроки[0].Значение = "643";			
		КонецЕсли;
	КонецЕсли;
     
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолныйПуть", "СведенияОПокупателе.НомерСтроки.Адрес.АдресИнформация.АдресТекст");
	//поиск строк
	мНайдСтроки = ДеревоДанных.Строки.НайтиСтроки(ПараметрыПоиска);
	Если мНайдСтроки.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(мНайдСтроки[0].Значение) Тогда
			Для каждого Строка из мНайдСтроки[0].КлючСообщения.КонтактнаяИнформация Цикл
				Если Строка.Вид.ИдентификаторДляФормул = "ЮридическийАдрес" Тогда 
					мНайдСтроки[0].Значение = Строка.Представление;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//определение параметров поиска для Грузоотправителе
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолныйПуть", "СведенияОГрузоотправителе.НомерСтроки.Грузоотправитель.Адрес.АдресИнформация.КодСтраны");
	//поиск строк
	мНайдСтроки = ДеревоДанных.Строки.НайтиСтроки(ПараметрыПоиска);
	Если мНайдСтроки.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(мНайдСтроки[0].Значение) Тогда
			// Если не заполнено, то вставляем код России
			мНайдСтроки[0].Значение = "643";			
		КонецЕсли;
	КонецЕсли;

	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ПолныйПуть", "СведенияОГрузоотправителе.НомерСтроки.Грузоотправитель.Адрес.АдресИнформация.АдресТекст");
	//поиск строк
	мНайдСтроки = ДеревоДанных.Строки.НайтиСтроки(ПараметрыПоиска);
	Если мНайдСтроки.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(мНайдСтроки[0].Значение) Тогда
			// Если не заполнено, то вставляем код России
			мНайдСтроки[0].Значение = мНайдСтроки[0].КлючСообщения.КонтактнаяИнформация[0].Представление;
		КонецЕсли;
	КонецЕсли;


	#КонецВставки

	Для Каждого СтрокаДерева Из ДеревоДанных.Строки Цикл
		ТекстОшибки = "";

		РеквизитЗаполненИлиОбязателен = ЗначениеЗаполнено(СтрокаДерева.Значение) ИЛИ НРег(СтрокаДерева.Обязательное) = "да";

		// Проверяем заполнение самого реквизита.
		ПроверитьЗаполнениеРеквизитаДереваДанных(СтрокаДерева, ПроверятьОбязательностьПараметровОшибки, ДатаПоФорматуФНС, ТекстОшибки);

		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ДобавитьОшибкуПроверкиДереваДанных(Ошибки, СтрокаДерева, ТекстОшибки,, НомерСтрокиДляПодстановки);

			Продолжить;
		КонецЕсли;

		// Запускаем проверки подчиненных реквизитов, если это структурированное значение.
		Если СтрокаДерева.Признак = "Таблица" И (ТипЗнч(СтрокаДерева.Значение) = Тип("Число") И СтрокаДерева.Значение > 0 ИЛИ СтрокаДерева.Обязательное = "Да")Тогда
			Для Каждого СтрокаТаблицы Из СтрокаДерева.Строки Цикл
				ПроверитьЗаполнениеРеквизитовДереваДанных(СтрокаТаблицы, Ошибки, Истина, СтрокаТаблицы.Значение,
				РеквизитЗаполненИлиОбязателен И ПроверятьОбязательностьПараметровОшибки, ДатаПоФорматуФНС);
			КонецЦикла;
		ИначеЕсли СтрокаДерева.Признак = "Выбор" И (ЗначениеЗаполнено(СтрокаДерева.Значение) ИЛИ СтрокаДерева.Обязательное = "Да") Тогда
			ПроверяемаяСтрока = СтрокаДерева.Строки.Найти(СтрокаДерева.ПолныйПуть + "." + СтрокаДерева.Значение, "ПолныйПуть");
			Если ЗначениеЗаполнено(ПроверяемаяСтрока) Тогда
				// Поскольку сменили текущую строку дерева, нужно проверить заполнение самого реквизита.
				ПроверитьЗаполнениеРеквизитаДереваДанных(ПроверяемаяСтрока, ПроверятьОбязательностьПараметровОшибки, ДатаПоФорматуФНС, ТекстОшибки);

				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					ДобавитьОшибкуПроверкиДереваДанных(Ошибки, ПроверяемаяСтрока, ТекстОшибки,, НомерСтрокиДляПодстановки);

					Продолжить;
				КонецЕсли;

				ПроверитьЗаполнениеРеквизитовДереваДанных(ПроверяемаяСтрока, Ошибки, Ложь,,
				РеквизитЗаполненИлиОбязателен И ПроверятьОбязательностьПараметровОшибки, ДатаПоФорматуФНС);
			Иначе
				ТекстОшибки = ТекстОшибкиНеЗаполненногоЗначенияДерева();

				ДобавитьОшибкуПроверкиДереваДанных(Ошибки, СтрокаДерева, ТекстОшибки);
			КонецЕсли;
		ИначеЕсли СтрокаДерева.Признак = "Группа" И СтрокаДерева.Значение = Истина И СтрокаДерева.Строки.Количество() > 0 Тогда
			ПроверитьЗаполнениеРеквизитовДереваДанных(СтрокаДерева, Ошибки, Ложь,,
			РеквизитЗаполненИлиОбязателен И ПроверятьОбязательностьПараметровОшибки, ДатаПоФорматуФНС);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
