
&НаСервере
Процедура Buro1Goz_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НоваяГруппа = ЭтаФорма.Элементы.Добавить("ПодГруппа", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаОрганизация);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	ПолеДляДокГОЗ = Элементы.Добавить("B1_КонтрактыГОЗ", Тип("ПолеФормы"), Элементы.ПодГруппа);
	ПолеДляДокГОЗ.Вид = ВидПоляФормы.ПолеВвода;
	ПолеДляДокГОЗ.МаксимальнаяШирина = 5;
	ПолеДляДокГОЗ.Заголовок = "Контракт ГОЗ(документ)";
	ПолеДляДокГОЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеДляДокГОЗ.ПутьКДанным = "Объект.ГозКонтракт";  
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("СозданиеКонтрактаГОЗ");
	НоваяКоманда.Действие = "ВыполнитьКоманду";
	НоваяКоманда.Заголовок = "Создать Контракт ГОЗ";
			
	НоваяКнопка = ЭтаФорма.Элементы.Добавить("B1_СозданиеКонтрактаГОЗ", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ПодГруппа);
	НоваяКнопка.ИмяКоманды = "СозданиеКонтрактаГОЗ";
	
КонецПроцедуры
