&Вместо("ТекстЗапросаТаблицаТоварыОрганизаций")
Функция Buro1Goz_ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет и ДокументОбъект.НеЗаписыватьСебестИТовОрг = Истина тогда
		//Возврат "";
	КонецЕсли;
	
	// продолжает выполнять код из основной конфы
	Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	Возврат Результат;
КонецФункции

//&Вместо("ТекстЗапросаТаблицаСебестоимостьТоваров")
//Функция Buro1Goz_ТекстЗапросаТаблицаСебестоимостьТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
//	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет и ДокументОбъект.НеЗаписыватьСебестИТовОрг = Истина тогда
//		//Возврат "";
//	КонецЕсли;
//	
//	// продолжает выполнять код из основной конфы
//	Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
//	Возврат Результат;
//КонецФункции

&Вместо("ДанныеДокументаДляПроведения")
Функция Buro1Goz_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(Документ, Регистры, ДопПараметры);
	//Попытка
	//	Если Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет и Документ.НеЗаписыватьСебестИТовОрг = Истина тогда
	//		Результат.Удалить("ТаблицаСебестоимостьТоваров");
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	
	Если Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет 
		И Документ.НеЗаписыватьСебестИТовОрг
		И НЕ Документ.Организация = Справочники.Организации.УправленческаяОрганизация Тогда
		
		Если Результат.Свойство("ТаблицаСебестоимостьТоваров") Тогда
			
			НайденныеСтроки = Результат["ТаблицаСебестоимостьТоваров"].НайтиСтроки(Новый Структура("Организация", Документ.Организация));
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
				Результат["ТаблицаСебестоимостьТоваров"].Удалить(НайденнаяСтрока);	
			
			КонецЦикла;		
		
		КонецЕсли;
		
		Если Результат.Свойство("ТаблицаТоварыОрганизаций") Тогда
			
			НайденныеСтроки = Результат["ТаблицаТоварыОрганизаций"].НайтиСтроки(Новый Структура("Организация", Документ.Организация));
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
				Результат["ТаблицаТоварыОрганизаций"].Удалить(НайденнаяСтрока);	
			
			КонецЦикла; 		
		
		КонецЕсли; 	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
