&После("ПриЗаписи")
Процедура Buro1Goz_ПриЗаписи(Отказ)
	
	Если Не Отказ И ЗначениеЗаполнено(Ссылка) Тогда
		НаборЗаписей = РегистрыНакопления.УчетШтрихКодов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		Если ОприходованиеСерийНаСклад Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СерийныеНомераНаПечатьСрезПоследних.СерийныйНомер КАК СерийныйНомер
			|ИЗ
			|	РегистрСведений.СерийныеНомераНаПечать.СрезПоследних(, ) КАК СерийныеНомераНаПечатьСрезПоследних
			|ГДЕ
			|	СерийныеНомераНаПечатьСрезПоследних.Реализация = &Реализация";
			Запрос.УстановитьПараметр("Реализация", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.Период = Дата;
				НоваяСтрока.СерийныйНомер = ВыборкаДетальныеЗаписи.СерийныйНомер;
				НоваяСтрока.Регистратор = Ссылка;
			КонецЦикла;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры
