
&НаСервере
Функция ПечатьФормы3НаСервере(мНоменклатура)
	// Вставить содержимое обработчика.
	ОбФормы = РеквизитФормыВЗначение("Объект");
	макет   = ОбФормы.ПолучитьМакет("мкФорма3");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма3";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	
	
	ОбластьШапка = макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры["ДокДата"] = "За " + строка(формат(Объект.Дата,"ДФ=MM.yyyy")) + " г.";
	ОбластьШапка.Параметры["НаимТовара"] = Строка(мНоменклатура);
	ОбластьШапка.Параметры["КодОКП"] = "1234";
	ОбластьШапка.Параметры["КодЕКПС"] = "2345";
	ОбластьШапка.Параметры["ФНН"] = "3456";
	ОбластьШапка.Параметры["ЕдиницаКальк"] = Строка(мНоменклатура.ЕдиницаИзмерения);
	ОбластьШапка.Параметры["ТехДокументация"] = "ТУ 45678";
	//ОбластьДанные = макет.ПолучитьОбласть("Данные");
	ОбластьПодвал = макет.ПолучитьОбласть("Подвал");
	ОбластьРасчПоказатели = макет.ПолучитьОбласть("РасчетныеПоказатели");
	ОбластьДоп    = макет.ПолучитьОбласть("Дополнение");
	
	ТабДок.Вывести(ОбластьШапка);
	СумЗатрат = 0;
	Для каждого стр из Объект.Затраты цикл 
		СумЗатрат = СумЗатрат + стр.Сумма;
		ОбластьСтр = макет.ПолучитьОбласть("СтДанных");
		ОбластьСтр.Параметры["КодСтатьиЗатрат"] = Строка(стр.СтатьяРасходов.Код);
		ОбластьСтр.Параметры["ИмяСтатьиЗатрат"] = Строка(стр.СтатьяРасходов);
		ОбластьСтр.Параметры["ПланСумма"] = "-";
		ОбластьСтр.Параметры["ФактСумма"] = Строка(стр.Сумма);
		ОбластьСтр.Параметры["Примечание"] = "-";
		ТабДок.Вывести(ОбластьСтр);
	КонецЦикла;
	ОбластьРасчПоказатели.Параметры["Себестоимость"] = СумЗатрат;
	
	СтрОтбора = Новый Структура;
	СтрОтбора.Вставить("Номенклатура", мНоменклатура);
	НСтроки = Объект.ОтгруженныеТовары.НайтиСтроки(СтрОтбора);
	ТабКопия = Объект.ОтгруженныеТовары.Выгрузить(НСтроки);
	мСумма = ТабКопия.Итог("СуммаСНДС");
	мКоличество = ТабКопия.Итог("Количество");
	мЦена = 0;
	Прибыль = 0;
	Если мКоличество > 0 Тогда
		мЦена = (мСумма/мКоличество) * 5 / 6;
	КонецЕсли;
	Прибыль = мСумма- СумЗатрат; 
	
	ОбластьРасчПоказатели.Параметры["Прибыль"] = Прибыль;
	ОбластьРасчПоказатели.Параметры["ЦенаБезНДС"] = мЦена;
	ТабДок.Вывести(ОбластьРасчПоказатели);
	//ТабДок.Вывести(ОбластьДанные);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьДоп);
	
	
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьФормы3(Команда)
	
	ТабДок = ПечатьФормы3НаСервере(Элементы.СобранныеИзделияИтого.ТекущиеДанные.Номенклатура);
	
	ВывестиТабДокНаПечать("мкФорма3",ТабДок);
	
КонецПроцедуры

&НаСервере
Функция ПечатьФормы4НаСервере(мНоменклатура)
	// Вставить содержимое обработчика.
	ОбФормы = РеквизитФормыВЗначение("Объект");
	макет   = ОбФормы.ПолучитьМакет("мкФорма4");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма4";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОбластьШапка = макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры["ТоварНаименование"] = "на " + Строка(мНоменклатура);
	ОбластьДанныеИтог = макет.ПолучитьОбласть("ДанныеИтог");
	ОбластьПодвал = макет.ПолучитьОбласть("Подвал");
	ОбластьДоп    = макет.ПолучитьОбласть("Дополнение");
	
	ТабДок.Вывести(ОбластьШапка);
	ии = 1;
	Для Каждого стр из Объект.Расходники цикл
		ии = ии + 1;
		ОбластьДанные = макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры["СтрНомер"] = ии;
		ОбластьДанные.Параметры["НаименованиеМ"] = Строка(стр.Номенклатура)+ " " + Строка(стр.Характеристика);
		ОбластьДанные.Параметры["НормаРасхода"] = Строка(стр.Количество);
		ОбластьДанные.Параметры["ЦенаЗаЕдиницуИзмерения"] = Строка(стр.Цена);
		ОбластьДанные.Параметры["Затраты"] = строка(стр.Количество*Стр.Цена);
		ОбластьДанные.Параметры["ОбДок"] = строка(Объект.Договор);
		ОбластьДанные.Параметры["МетодЦены"] = "Сравнимой цены";
		ОбластьДанные.Параметры["ПоставщикНаим"] = стр.ДокументПриобретения.Контрагент;
		ОбластьДанные.Параметры["ПостИНН"] = стр.ДокументПриобретения.Контрагент.ИНН;
		мНомерДата = СтрШаблон("№%1 от %2", СокрЛП(стр.ДокументПриобретения.НомерВходящегоДокумента), Формат(стр.ДокументПриобретения.ДатаВходящегоДокумента, "ДЛФ=Д"));
		ОбластьДанные.Параметры["НомерДата"] = мНомерДата;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьДанныеИтог);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьДоп);
	
	
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьФормы4(Команда)
	
	ТабДок = ПечатьФормы4НаСервере(Элементы.СобранныеИзделияИтого.ТекущиеДанные.Номенклатура);
	
	ВывестиТабДокНаПечать("мкФорма4",ТабДок);
	
КонецПроцедуры

&НаСервере
Функция ПечатьФормы5НаСервере(мНоменклатура)
	// Вставить содержимое обработчика.
	ОбФормы = РеквизитФормыВЗначение("Объект");
	макет   = ОбФормы.ПолучитьМакет("мкФорма5");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма5";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОбластьШапка = макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры["ТоварНаименование"] = "на " + Строка(мНоменклатура);
	//ОбластьДанные = макет.ПолучитьОбласть("Данные");
	ОбластьДанныеИтог = макет.ПолучитьОбласть("ДанныеИтог");
	ОбластьПодвал = макет.ПолучитьОбласть("Подвал");
	ОбластьДоп    = макет.ПолучитьОбласть("Дополнение");
	
	ТабДок.Вывести(ОбластьШапка);
	ии = 1;
	Для Каждого стр из Объект.Полуфабрикаты цикл
		ии = ии + 1;
		ОбластьДанные = макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры["СтрНомер"] = ии;
		ОбластьДанные.Параметры["НаименованиеП"] = Строка(стр.Номенклатура) + " " + Строка(стр.Характеристика);
		ОбластьДанные.Параметры["НормаРасхода"] = Строка(стр.Количество);
		ОбластьДанные.Параметры["ЦенаЗаЕдиницуИзмерения"] = Строка(стр.Цена);
		ОбластьДанные.Параметры["Затраты"] = Строка(стр.Количество*стр.Цена);
		ОбластьДанные.Параметры["ОбДок"] = Строка(Объект.Договор);
		ОбластьДанные.Параметры["МетодЦены"] = "Сравнимой цены";
		ОбластьДанные.Параметры["ПоставщикНаим"] = стр.ДокументПриобретения.Контрагент;
		ОбластьДанные.Параметры["ПостИНН"] = стр.ДокументПриобретения.Контрагент.ИНН;
		мНомерДата = СтрШаблон("№%1 от %2", СокрЛП(стр.ДокументПриобретения.НомерВходящегоДокумента), Формат(стр.ДокументПриобретения.ДатаВходящегоДокумента, "ДЛФ=Д"));
		ОбластьДанные.Параметры["НомерДата"] = мНомерДата;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	ТабДок.Вывести(ОбластьДанныеИтог);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьДоп);
	
	
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ПечатьФормы5(Команда)
	
	ТабДок = ПечатьФормы5НаСервере(Элементы.СобранныеИзделияИтого.ТекущиеДанные.Номенклатура);
	
	ВывестиТабДокНаПечать("мкФорма5",ТабДок);
	
КонецПроцедуры

&НаСервере
Функция ПечатьФормы6НаСервере(мНоменклатура)
	// Вставить содержимое обработчика.
	ОбФормы = РеквизитФормыВЗначение("Объект");
	макет   = ОбФормы.ПолучитьМакет("мкФорма6");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма6";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОбластьШапка = макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры["ТоварНаименование"] = "на " + Строка(мНоменклатура);
	//ОбластьДанные = макет.ПолучитьОбласть("Данные");
	ОбластьДанныеИтог = макет.ПолучитьОбласть("ДанныеИтог");
	ОбластьПодвал = макет.ПолучитьОбласть("Подвал");
	ОбластьДоп    = макет.ПолучитьОбласть("Дополнение");
	
	ТабДок.Вывести(ОбластьШапка);
	ии = 0;
	для каждого стр из Объект.Комплектующие цикл
		ии = ии + 1;
		ОбластьДанные = макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры["СтрНомер"] = ии;
		ОбластьДанные.Параметры["КомплНаименование"] = Строка(стр.Номенклатура) + " " +Строка(стр.Характеристика);
		ОбластьДанные.Параметры["НормаРасхода"] = Строка(стр.Количество);
		ОбластьДанные.Параметры["ЦенаЗаЕдиницуИзмерения"] = строка(стр.Цена);
		ОбластьДанные.Параметры["Затраты"] = Строка(стр.Количество*стр.Цена);
		ОбластьДанные.Параметры["ОбДок"] = Строка(Объект.Договор);
		ОбластьДанные.Параметры["МетодЦены"] = "Сравнимой цены";
		ОбластьДанные.Параметры["ПоставщикНаим"] = стр.ДокументПриобретения.Контрагент;
		ОбластьДанные.Параметры["ПостИНН"] = стр.ДокументПриобретения.Контрагент.ИНН;
		мНомерДата = СтрШаблон("№%1 от %2", СокрЛП(стр.ДокументПриобретения.НомерВходящегоДокумента), Формат(стр.ДокументПриобретения.ДатаВходящегоДокумента, "ДЛФ=Д"));
		ОбластьДанные.Параметры["НомерДата"] = мНомерДата;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	//ТабДок.Вывести(ОбластьДанные);
	Табдок.Вывести(ОбластьДанныеИтог);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьДоп);
	
	
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьФормы6(Команда)
	
	ТабДок = ПечатьФормы6НаСервере(Элементы.СобранныеИзделияИтого.ТекущиеДанные.Номенклатура);
	
	ВывестиТабДокНаПечать("мкФорма6",ТабДок);
	
КонецПроцедуры

&НаСервере
Функция ПечатьФормы7НаСервере()
	// Вставить содержимое обработчика.
	ОбФормы = РеквизитФормыВЗначение("Объект");
	макет   = ОбФормы.ПолучитьМакет("мкФорма7");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма7";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОбластьШапка = макет.ПолучитьОбласть("Шапка");
	ОбластьДанные = макет.ПолучитьОбласть("Данные");
	ОбластьПодвал = макет.ПолучитьОбласть("Подвал");
	ОбластьДоп    = макет.ПолучитьОбласть("Дополнение");
	
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьДанные);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьДоп);
	
	
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьФормы7(Команда)
	ТабДок = ПечатьФормы7НаСервере();
	//ТабДок.Показать();
	ВывестиТабДокНаПечать("мкФорма7",ТабДок);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиТабДокНаПечать(ИмяМакета, ТабДок)
	коллекция = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИмяМакета);
	Структураколлекции = коллекция.Получить(0);
	Структураколлекции.ТабличныйДокумент = ТабДок;
	УправлениеПечатьюКлиент.ПечатьДокументов(коллекция,,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоКонтрактуНаСервере()
	// Вставить содержимое обработчика.
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СборкаТоваровТовары.Номенклатура КАК Номенклатура,
	|	СборкаТоваровТовары.Характеристика КАК Характеристика,
	|	СУММА(СборкаТоваровТовары.Количество) КАК Количество,
	|	СборкаТоваровТовары.Ссылка КАК СобираемыйТовар
	|ПОМЕСТИТЬ КомплСборки
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
	|ГДЕ
	|	СборкаТоваровТовары.Ссылка.ГозКонтракт = &ГозКонтракт
	|	И СборкаТоваровТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И СборкаТоваровТовары.Ссылка.Проведен = ИСТИНА
	|	И СборкаТоваровТовары.Ссылка.ХозяйственнаяОперация = &СборкаИзКомплектующих
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаТоваровТовары.Номенклатура,
	|	СборкаТоваровТовары.Характеристика,
	|	СборкаТоваровТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество,
	|	СУММА(ПриобретениеТоваровУслугТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ Поступл1
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка.ГозКонтракт = &ГозКонтракт
	|	И ПриобретениеТоваровУслугТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ТЧ.Номенклатура
	|			ИЗ
	|				КомплСборки КАК ТЧ)
	|	И ПриобретениеТоваровУслугТовары.Характеристика В
	|			(ВЫБРАТЬ
	|				ТЧ2.Характеристика
	|			ИЗ
	|				КомплСборки КАК ТЧ2)
	|	И ПриобретениеТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поступл1.Номенклатура КАК Номенклатура,
	|	Поступл1.Характеристика КАК Характеристика,
	|	Поступл1.Сумма / Поступл1.Количество КАК СрЦенаПоступления
	|ПОМЕСТИТЬ Поступл2
	|ИЗ
	|	Поступл1 КАК Поступл1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомплСборки.Номенклатура КАК Номенклатура,
	|	КомплСборки.Характеристика КАК Характеристика,
	|	КомплСборки.Количество КАК Количество,
	|	КомплСборки.СобираемыйТовар КАК СобираемыйТовар,
	|	Поступл2.СрЦенаПоступления КАК Цена
	|ИЗ
	|	КомплСборки КАК КомплСборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Поступл2 КАК Поступл2
	|		ПО КомплСборки.Номенклатура = Поступл2.Номенклатура
	|			И КомплСборки.Характеристика = Поступл2.Характеристика";
	Запрос.УстановитьПараметр("ГозКонтракт",Объект.Ссылка);
	Запрос.УстановитьПараметр("СборкаИзКомплектующих",Перечисления.ХозяйственныеОперации.СборкаТоваров);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	объект.ОтгруженныеТовары.Очистить();
	Объект.Комплектация.Очистить();
	
	ТекСобТовар = Документы.СборкаТоваров.ПустаяСсылка();
	для каждого стр из Результат цикл
		Если ТекСобТовар <> стр.СобираемыйТовар тогда
			НовСтрТчТоваров = Объект.ОтгруженныеТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТчТоваров,стр.СобираемыйТовар);
		КонецЕсли;
		НовСтрТЧКомпл = объект.Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрТЧКомпл,стр);
		НовСтрТЧКомпл.СобираемаяНоменклатура   = стр.СобираемыйТовар.Номенклатура;
		НовСтрТЧКомпл.СобираемаяХарактеристика = стр.СобираемыйТовар.Характеристика;
		ТекСобТовар = стр.СобираемыйТовар;
	КонецЦикла; 
	
	// Собрано
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СборкаТоваров.Номенклатура КАК Номенклатура,
	|	СборкаТоваров.Характеристика КАК Характеристика,
	|	СУММА(СборкаТоваров.Количество) КАК Количество,
	|	СборкаТоваров.Ссылка КАК ДокументСборки
	|ПОМЕСТИТЬ ТабСборка
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|ГДЕ
	|	СборкаТоваров.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И СборкаТоваров.Ссылка.Проведен = ИСТИНА
	|	И СборкаТоваров.ГозКонтракт = &ГозКонтракт
	|	И СборкаТоваров.ХозяйственнаяОперация = &СборкаИзКомплектующих
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаТоваров.Номенклатура,
	|	СборкаТоваров.Характеристика,
	|	СборкаТоваров.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////0
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ТабРеализовано
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|	И РеализацияТоваровУслугТовары.Ссылка.ГозКонтракт = &ГозКонтракт
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	ТабСборка.Номенклатура КАК Номенклатура,
	|	ТабСборка.Характеристика КАК Характеристика,
	|	ТабСборка.Количество КАК Количество,
	|	ТабСборка.ДокументСборки КАК ДокументСборки,
	|	ТабРеализовано.Количество КАК Отгружено
	|ИЗ
	|	ТабСборка КАК ТабСборка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабРеализовано КАК ТабРеализовано
	|		ПО ТабСборка.Номенклатура = ТабРеализовано.Номенклатура
	|			И ТабСборка.Характеристика = ТабРеализовано.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ДокументСборки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК ДокументОтгрузки,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.СуммаСНДС КАК СуммаСНДС,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	|	И РеализацияТоваровУслугТовары.Ссылка.ГозКонтракт = &ГозКонтракт
	|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура,
	//|	ДокументОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка КАК ДокументОтгрузки,
	|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
	|	КорректировкаРеализацииТовары.Характеристика КАК Характеристика,
	|	КорректировкаРеализацииТовары.Количество КАК Количество,
	|	Выбор когда КорректировкаРеализацииТовары.Количество = 0 Тогда 0 Иначе КорректировкаРеализацииТовары.Сумма / КорректировкаРеализацииТовары.Количество Конец КАК Цена,
	|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
	|	КорректировкаРеализацииТовары.СуммаСНДС КАК СуммаСНДС,
	|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Расхождения КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И КорректировкаРеализацииТовары.Ссылка.Проведен = ИСТИНА
	|	И КорректировкаРеализацииТовары.Ссылка.ГозКонтракт = &ГозКонтракт
	|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура,
	//|	ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ
	|	СборкаТоваровТовары.Номенклатура КАК Номенклатура,
	|	СборкаТоваровТовары.Характеристика КАК Характеристика,
	|	СУММА(СборкаТоваровТовары.Количество) КАК Количество,
	|	СборкаТоваровТовары.Ссылка.Номенклатура КАК СобираемаяНоменклатура,
	|	СборкаТоваровТовары.Ссылка.Характеристика КАК СобираемаяХарактеристика
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
	|ГДЕ
	|	СборкаТоваровТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И СборкаТоваровТовары.Ссылка.Проведен = ИСТИНА
	|	И СборкаТоваровТовары.Ссылка.ГозКонтракт = &ГозКонтракт
	|	И СборкаТоваровТовары.Ссылка.ХозяйственнаяОперация = &СборкаИзКомплектующих
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаТоваровТовары.Номенклатура,
	|	СборкаТоваровТовары.Характеристика,
	|	СборкаТоваровТовары.Ссылка.Номенклатура,
	|	СборкаТоваровТовары.Ссылка.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	СобираемаяНоменклатура,
	|	СобираемаяХарактеристика,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК ДокументПриобретения,
	|	ПриобретениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	ПриобретениеТоваровУслугТовары.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.Количество <> 0
	|			ТОГДА ПриобретениеТоваровУслугТовары.Сумма * ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Количество / ПриобретениеТоваровУслугТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.Количество <> 0
	|			ТОГДА ПриобретениеТоваровУслугТовары.СуммаСНДС * ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Количество / ПриобретениеТоваровУслугТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСНДС,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ТабПоступления
	|ИЗ
	|	Справочник.ЗакупкаТоваровВРазрезеГозКонтракта.Товары КАК ЗакупкаТоваровВРазрезеГозКонтрактаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ПО ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Ссылка.ПриобретениеТоваровУслуг = ПриобретениеТоваровУслугТовары.Ссылка
	|			И ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Номенклатура = ПриобретениеТоваровУслугТовары.Номенклатура
	|			И ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Характеристика = ПриобретениеТоваровУслугТовары.Характеристика
	|ГДЕ
	|	ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Ссылка.ПриобретениеТоваровУслуг.Проведен = ИСТИНА
	|	И ЗакупкаТоваровВРазрезеГозКонтрактаТовары.Ссылка.ПриобретениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И ЗакупкаТоваровВРазрезеГозКонтрактаТовары.ГозКонтракт = &ГозКонтракт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПоступления.Номенклатура КАК Номенклатура,
	|	ТабПоступления.Характеристика КАК Характеристика,
	|	ТабПоступления.ДокументПриобретения КАК ДокументПриобретения,
	|	ТабПоступления.Цена КАК Цена,
	|	ТабПоступления.Сумма КАК Сумма,
	|	ТабПоступления.СуммаСНДС КАК СуммаСНДС,
	|	ТабПоступления.СтавкаНДС КАК СтавкаНДС,
	|	ТабПоступления.Количество КАК Количество
	|ИЗ
	|	ТабПоступления КАК ТабПоступления
	|ГДЕ
	|	ТабПоступления.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыКомплектующие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПоступления.Номенклатура КАК Номенклатура,
	|	ТабПоступления.Характеристика КАК Характеристика,
	|	ТабПоступления.ДокументПриобретения КАК ДокументПриобретения,
	|	ТабПоступления.Цена КАК Цена,
	|	ТабПоступления.Сумма КАК Сумма,
	|	ТабПоступления.СуммаСНДС КАК СуммаСНДС,
	|	ТабПоступления.СтавкаНДС КАК СтавкаНДС,
	|	ТабПоступления.Количество КАК Количество
	|ИЗ
	|	ТабПоступления КАК ТабПоступления
	|ГДЕ
	|	ТабПоступления.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыРасходники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПоступления.Номенклатура КАК Номенклатура,
	|	ТабПоступления.Характеристика КАК Характеристика,
	|	ТабПоступления.ДокументПриобретения КАК ДокументПриобретения,
	|	ТабПоступления.Цена КАК Цена,
	|	ТабПоступления.Сумма КАК Сумма,
	|	ТабПоступления.СуммаСНДС КАК СуммаСНДС,
	|	ТабПоступления.СтавкаНДС КАК СтавкаНДС,
	|	ТабПоступления.Количество КАК Количество
	|ИЗ
	|	ТабПоступления КАК ТабПоступления
	|ГДЕ
	|	ТабПоступления.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыПолуфабрикаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугГОЗ.СтатьиРасходовГоз КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугГОЗ.СуммаДокументаВРублях > 0
	|			ТОГДА ПриобретениеТоваровУслугГОЗ.СуммаДокументаВРублях
	|		ИНАЧЕ ПриобретениеТоваровУслугГОЗ.Сумма
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ТабЗатраты
	|ИЗ
	|	Справочник.ЗакупкаТоваровВРазрезеГозКонтракта.СтатьиЗатрат КАК ПриобретениеТоваровУслугГОЗ
	|ГДЕ
	|	ПриобретениеТоваровУслугГОЗ.ГозКонтракт = &ГозКонтракт
	|	И ПриобретениеТоваровУслугГОЗ.Ссылка.ПриобретениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПриобретениеТоваровУслугГОЗ.Ссылка.ПриобретениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеУслугПрочихАктивовГОЗ.СтатьиРасходовГоз,
	|	ПриобретениеУслугПрочихАктивовГОЗ.Сумма
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов.ГОЗ КАК ПриобретениеУслугПрочихАктивовГОЗ
	|ГДЕ
	|	ПриобретениеУслугПрочихАктивовГОЗ.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПриобретениеУслугПрочихАктивовГОЗ.Ссылка.Проведен = ИСТИНА
	|	И ПриобретениеУслугПрочихАктивовГОЗ.Ссылка.ГозКонтракт = &ГозКонтракт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияИмпорт.СтатьиРасходовГоз,
	|	ТаможеннаяДекларацияИмпорт.СуммаДокумента
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт КАК ТаможеннаяДекларацияИмпорт
	|ГДЕ
	|	ТаможеннаяДекларацияИмпорт.ГозКонтракт = &ГозКонтракт
	|	И ТаможеннаяДекларацияИмпорт.Проведен = ИСТИНА
	|	И ТаможеннаяДекларацияИмпорт.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЗатраты.СтатьяРасходов КАК СтатьяРасходов,
	|	СУММА(ТабЗатраты.Сумма) КАК Сумма
	|ИЗ
	|	ТабЗатраты КАК ТабЗатраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабЗатраты.СтатьяРасходов";
	Запрос.УстановитьПараметр("ГозКонтракт", Объект.Ссылка);
	Запрос.УстановитьПараметр("СборкаИзКомплектующих", Перечисления.ХозяйственныеОперации.СборкаТоваров);
	Запрос.УстановитьПараметр("ВидНоменклатурыКомплектующие", 	Справочники.ПредопределенныеЗначения.ПолучитьПредопределенноеЗначение("КомплектующиеГОЗ"));
	Запрос.УстановитьПараметр("ВидНоменклатурыРасходники", 		Справочники.ПредопределенныеЗначения.ПолучитьПредопределенноеЗначение("РасходникиГОЗ"));
	Запрос.УстановитьПараметр("ВидНоменклатурыПолуфабрикаты", 	Справочники.ПредопределенныеЗначения.ПолучитьПредопределенноеЗначение("ПолуфабрикатыГОЗ"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТабДанных = МассивРезультатов[2].Выгрузить();
	Объект.СобранныеИзделияДетально.Загрузить(ТабДанных);
	//Врем решение
	Для каждого стр из объект.СобранныеИзделияДетально цикл
		стр.КоличествоНормоЧасовНаСборку = стр.ДокументСборки.КоличествоНормоЧасовНаСборку;
		стр.СтоимостьНормоЧасаНаСборку = стр.ДокументСборки.СтоимостьНормоЧасаНаСборку;
		Попытка
			стр.СуммаЗарплатныхЗатратНаСборку = Число(стр.Количество) * стр.КоличествоНормоЧасовНаСборку * стр.СтоимостьНормоЧасаНаСборку;	
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	//Врем решение
	
	ТабДанных.Свернуть("Номенклатура, Характеристика, Отгружено", "Количество");
	Объект.СобранныеИзделияИтого.Загрузить(ТабДанных);
	
	ТабДанных = МассивРезультатов[3].Выгрузить();
	Объект.ОтгруженныеТовары.Загрузить(ТабДанных);
	Объект.ОтгруженныеТовары.Сортировать("Номенклатура, ДокументОтгрузки");
	
	ТабДанных = МассивРезультатов[4].Выгрузить();
	Объект.Комплектация.Загрузить(ТабДанных);
	
	Объект.Комплектующие.Загрузить(МассивРезультатов[6].Выгрузить());
	
	Объект.Расходники.Загрузить(МассивРезультатов[7].Выгрузить());
	
	Объект.Полуфабрикаты.Загрузить(МассивРезультатов[8].Выгрузить());
	
	Объект.Затраты.Загрузить(МассивРезультатов[10].Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыПоКонтракту(Команда)
	ЗаполнитьТоварыПоКонтрактуНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьФормы9НаСервере(мНоменклатура)
	// Вставить содержимое обработчика.
	ОбФормы = РеквизитФормыВЗначение("Объект");
	макет   = ОбФормы.ПолучитьМакет("мкФорма9");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма9";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ОбластьШапка = макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры["ТоварНаименование"] = "затрат на основную заработную плату на " + Строка(мНоменклатура);
	ТабДок.Вывести(ОбластьШапка);
	СтрОтбора = Новый Структура;
	СтрОтбора.Вставить("Номенклатура", мНоменклатура);
	ТбДляФормы9 = Объект.СобранныеИзделияДетально.Выгрузить();
	ТбДляФормы9.Свернуть("Номенклатура","Количество, КоличествоНормоЧасовНаСборку, СтоимостьНормоЧасаНаСборку, СуммаЗарплатныхЗатратНаСборку");
	МДляЗаполнениеяТч = ТбДляФормы9.НайтиСтроки(СтрОтбора);
	
	Если МДляЗаполнениеяТч.Количество() = 1 тогда
		ОбластьДанные = макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры["СтрНомер"] = 1;
		ОбластьДанные.Параметры["ВидРабот"] = "Сборка " + Строка(мНоменклатура) + " в количестве(шт.): " + Строка(МДляЗаполнениеяТч[0].Количество);
		ОбластьДанные.Параметры["Трудоемкость"] = МДляЗаполнениеяТч[0].КоличествоНормоЧасовНаСборку;
		ОбластьДанные.Параметры["СтоимостьНормоЧаса"] = МДляЗаполнениеяТч[0].СтоимостьНормоЧасаНаСборку;
		ОбластьДанные.Параметры["Зарплата"] = МДляЗаполнениеяТч[0].СуммаЗарплатныхЗатратНаСборку;
		ТабДок.Вывести(ОбластьДанные);
	КонецЕсли;
	ОбластьПодвал = макет.ПолучитьОбласть("Подвал");
	ОбластьДоп    = макет.ПолучитьОбласть("Дополнение");
	
	//ТабДок.Вывести(ОбластьШапка);
	//ТабДок.Вывести(ОбластьДанные);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьДоп);
	
	
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьФормы9(Команда)
	ТабДок = ПечатьФормы9НаСервере(Элементы.СобранныеИзделияИтого.ТекущиеДанные.Номенклатура);
	ВывестиТабДокНаПечать("мкФорма9",ТабДок);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДокументыПоКонтракту.Параметры.УстановитьЗначениеПараметра("ГозКонтракт", Объект.Ссылка);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгруженныеТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ОтгруженныеТовары.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено И ЗначениеЗаполнено(ТекДанные.ДокументОтгрузки) Тогда
	
		ПоказатьЗначение(, ТекДанные.ДокументОтгрузки);	
	
	КонецЕсли;
	
КонецПроцедуры
